ab
aqua
ab
surdus
aevum
ago
alius
alius
bassus
bassus
battuo
battuo
battuo
battuo
battuo
battuo
axis
abbatia
abbatia
abbatia
abbatia
abbatia
abbatia
brevis
brevis
brevis
brevis
brevis
dico (1)

abdication
abdicator
abdomen
abdominal
abdominally
abduce
abducent
abduct
abductee
abduction
abductive
abductor
abend
aberrance
aberrancy
aberrant
aberrate
aberration
aberrational
aberrometer
abhor
abhorence
abhorrent
abhorrently
abience
abient
abietic
-ability
ability
ab initio
abirritant
abirritate
abject
abjection
abjectly
abjoint
abjuration
abjure
ablactate
ablactation
ablate
ablation
ablative
ablator
-able
able

dico (1)
dico (1)
abdomen
abdomen
abdomen
duco
duco
duco
duco
duco
duco
duco
norma
erro
erro
erro
erro
erro
erro
erro
horreo
horreo
horreo
horreo
eo
eo
abies
habeo
habeo
eo
rito
rito
iacio
iacio
iacio
iungo
ius
ius
lac
lac
fero
fero
fero
fero
habeo
habeo

able-bodied
ableism
abluent
ablution
ablutionary
-ably
ably
abnegate
abnegation
abnormal
abnormality
abnormally
abolish
abolisher
abolition
abolitionary
abolitionism
abolishionist
abolishionistic
abominable
abominably
abominate
abomination
abominator
aboriginal
aboriginally
aborigines
ab origo
abort
aborticide
abortifacient
abortion
abortionist
abortive
abortively
abortuary
abound
about-face
ab ovo
abradant
abrade
abrader
abrasion
abrasive
abrasively
abreaction

habeo
habeo
lavo
lavo
lavo
habeo
habeo
nego
nego
norma
norma
norma
aboleo
aboleo
aboleo
aboleo
aboleo
aboleo
aboleo
omen
omen
omen
omen
omen
orior
orior
orior
orior
orior
orior/caedo
orior/facio
orior
orior
orior
orior
orior
unda
facio
ovum
rado
rado
rado
rado
rado
rado
ago

abridge
abridgement
abridger
abrogate
abrogation
abrogator
abrupt
abruption
abruptly
absabs
abscess
abscessed
abscind
abscise
abscissa
abscission
abscond
abscondence
absconder
absence
absent
absentee
absenteeism
absenter
absently
absentminded
absentmindedly
absolute
absolutely
absolute state
absolution
absolutism
absolutist
absolutistic
absolutize
absolvable
absolve
absonant
absorb
absorbability
absorbable
absorbed
absorbefacient
absorbent
absorbing

brevis
brevis
brevis
rogo
rogo
rogo
rumpo
rumpo
rumpo
ab
abdomen
cedo
cedo
scindo
caedo
scindo
scindo
condo
condo
condo
sum
sum
sum
sum
sum
sum
sum
sum
solvo
solvo
solvo/sto
solvo
solvo
solvo
solvo
solvo
solvo
solvo
sonus
sorbeo
sorbeo
sorbeo
sorbeo
sorbeo/facio
sorbeo
sorbeo

absorption
absorptive
abstain
abstainer
abstemious
abstemiously
abstemiousness
abstention
absterge
abstergent
abstersion
abstersive
abstinence
abstinent
abstract
abstracted
abstractedly
abstraction
abstractionism
abstractionist
abstractionistic
abstractive
abstractly
abstractor
abstractum
abstruse
abstrusity
absurd
absurdism
absurdist
absurdity
absurdly
abundance
abundant
abundantly
ab urbe condita
abusable
abusage
abuse
abuser
abusive
abusively
AC
acalculia
a capella
acaudal

sorbeo
sorbeo
teneo
teneo
temetum
temetum
temetum
teneo
tergeo
tergeo
tergeo
tergeo
teneo
teneo
traho
traho
traho
traho
traho
traho
traho
traho
traho
traho
traho
trudo
trudo
surdus
surdus
surdus
surdus
surdus
unda
unda
unda
urbs/condo
utor
utor
utor
utor
utor
utor
alter/curro
calx
cappa
cauda

acaulescent
acausal
accede
accelerando
accelerant
accelerate
accelerated
acceleration
accelerator
accelerometer
accent
accentual
accentuate
accentuation
accentuator
accentus
accept
acceptability
acceptable
acceptably
acceptance
acceptant
acceptation
accepted
accepting
acceptor
access
accessary
accessibility
accessible
accession
accessorial
accessorize
accessory
accidence
accident
accidental
accidentally
accipiter
accipitrine
acclaim
acclaimer
acclamation
acclamatory
acclivitous
acclivity

caulis
causa
cedo
celer
celer
celer
celer
celer
celer
celer
cano
cano
cano
cano
cano
cano
capio
capio
capio
capio
capio
capio
capio
capio
capio
capio
cedo
cedo
cedo
cedo
cedo
cedo
cedo
cedo
cado
cado
cado
cado
accipiter
accipiter
clamo
clamo
clamo
clamo
clivis
clivis

accolade
accommodable
accommodate
accommodating
accommodation
accompaniment
accompanist
accompany
accomplice
accomplish
accomplished
accomplishment
accord
accordance
accordant
accordantly
according
accordingly
accordion
accost
accostable
account
accountability
accountable
accountancy
accountant
accounting
accoutre
accoutrement
accredit
accreditation
accrescence
accrescent
accrete
accretion
accretionary
accretor
accrual
accrue
accubation
acculturate
acculturation
acculturist
accumbent
accumulate
accumulation

collum
modus
modus
modus
modus
panis
panis
panis
plecto
pleo
pleo
pleo
cor
cor
cor
cor
cor
cor
cor
costa
costa
puto
puto
puto
puto
puto
puto
suesco
suesco
credo
credo
cresco
cresco
cresco
cresco
cresco
cresco
cresco
cresco
cubo
colo
colo
colo
cubo
cumulus
cumulus

accumulative
accumulator
accuracy
accurate
accurately
accusation
accusative
accusator
accusatory
accuse
accuser
accustom
accustomed
ace
acellular
acerb
acerbate
acerbic
acerbity
acervation
acescent
acetabulum
acetate
acetic
acetone
acetosalicylic
acetous
acetyl
acetylene
ache
achievable
achieve
achievement
achiever
acicula
acicular
acid
acidic
acidification
acidify
acidity
acidly
acidosis
acidulate
acidulous
acidulously

cumulus
cumulus
cura
cura
cura
causa
causa
causa
causa
causa
causa
suesco
suesco
as
celo
acer
acer
acer
acer
acervus
acer
acer
acer
acer
acer
acer/salix
acer
acer
acer
ango
caput
caput
caput
caput
acer
acer
acer
acer
acer
acer
acer
acer
acer
acer
acer
acer

aciform
-acious
aciniform
aclinal
-acity
acquaint
acquaintance
acquaintanceship
acquainted
acquiesce
acquiescence
acquiescent
acquire
acquirement
acquisition
acquisitive
acquisitory
acquit
acquittal
acquittance
acre
acreage
acrid
acridine
acridity
acrimonious
acrimoniously
acrimony
across
acrylic
act
actable
acting
action
actionable
activation
activate
activator
active
actively
active-matrix
activism
activist
activity
actor
actress

acer/forma
-acius
acinus/forma
clivis
-acitas
nosco
nosco
nosco
nosco
quies
quies
quies
quaero
quaero
quaero
quaero
quaero
quies
quies
quies
ager
ager
acer
acer
acer
acer
acer
acer
crux
acer/oleo
ago
ago
ago
ago
ago
ago
ago
ago
ago
ago
ago/mater
ago
ago
ago
ago
ago

Acts
actual
actuality
actually
actuarily
actuary
actuate
actuator
acuate
acuity
aculeate
acumen
acuminate
acumination
acuminiferous
acupressure
acupuncture
acute
acutely
acuteness
acutifoliate
-acy
A.D.
adad
ad absurdum
adage
adagio (It)
adapt
adaptability
adaptable
adaptation
adapter
adaptive
adaptor
add
addendum
adder (snake)
addict
addicted
addiction
addictionologist
addictive
addition
additional
additionally

ago
ago
ago
ago
ago
ago
ago
ago
acer
acer
acer
acer
acer
acer
acer/fero
acer/premo
acer/pungo
acer
acer
acer
acer/folium
-acia, -atia
annus/domus
ad
verto
surdus
aio
iaceo
aptus
aptus
aptus
aptus
aptus
aptus
aptus
do
do
do
dico
dico
dico
dico
dico
do
do
do

additive
additively
additory
addle
add-on
address
addressable
addressee
addresser
adduce
adducer
adducible
adduct
adduction
adductive
adductor
adeciduate
adeem
ademption
adept
adeptly
adeptness
adequacy
adequate
adequately
adequation
a deux (Fr)
ad extremum
ad finitum
adhere
adherence
adherend
adherent
adhesion
adhesional
adhesive
adhibit
ad hoc
ad hominem
adieu (Fr)
ad infinitum
adios (Sp)
adipose
adiposity
adit
adj.

do
do
do
do
do
rego
rego
rego
rego
duco
duco
duco
duco
duco
duco
duco
cado
emo
emo
aptus
aptus
aptus
aequus
aequus
aequus
aequus
duo
exter
finis
haereo
haereo
haereo
haereo
haereo
haereo
haereo
habeo
hic
homo
deus
finis
deus
adeps
adeps
eo
iacio

adjacency
adjacent
adjectival
adjectivally
adjective
adjoin
adjoining
adjoint
adjourn
adjournment
adjudge
adjudicate
adjudication
adjudicative
adjudicator
adjunct
adjunction
adjunctive
adjuration
adjure
adjust
adjustable
adjuster
adjustment
adjutancy
adjutant
adlib
ad libitum

iaceo
iaceo
iacio
iacio
iacio
iungo
iungo
iungo
dies
dies
ius/dico
ius/dico
ius/dico
ius/dico
ius/dico
iungo
iungo
iungo
ius
ius
iungo
iungo
iungo
iungo
iuvo
iuvo
libet
libet
ad maiorem Dei gloriam magis/deus/gloria
ad malam crucem malus/crux
admedial
medius
admeasure
metior
admeasurement
metior
administer
minor
administrate
minor
administration
minor
administrative
minor
administrator
minor
administratrix
minor
mirus
admirable
admirably
mirus
admiral
mirus
admiration
mirus
admire
mirus
admirer
mirus
admiringly
mirus

admissible
admission
admissive
admit
admittable
admittance
admittedly
admix
admixture
admonish
admonisher
admonition
admonitorial
admonitory
adolesce
adolescence
adolescent
adopt
adoptability
adoptable
adoptee
adopter
adoption
adoptive
adorable
adorably
adoration
adore
adoringly
adorn
adorned
adornment
adrenal
adrenalin(e)
adrenergic
Adrian
Adrianne
Adrianople
adroit
adroitly
adroitness
ads
adscititous
adscription
adsorbent
adsorption

mitto
mitto
mitto
mitto
mitto
mitto
mitto
misceo
misceo
moneo
moneo
moneo
moneo
moneo
alo
alo
alo
opto
opto
opto
opto
opto
opto
opto
os
os
os
os
os
orno
orno
orno
renes
renes
renes
Hadrianus
Hadrianus
Hadrianus
rego
rego
rego
verto
scio
scribo
sorbeo
sorbeo

adulate
adulation
adulatory
adult
adulter
adulterant
adulterate
adulteration
adulterer
adulteress
adulterine
adulterous
adultery
adulthood
adumbrate
adumbration
aduncate
aduncity
aduncous
adust
adustiosis
adv.
ad valorem
advance
advanced
advancement
advantage
advantageous
advantageously
advection
advective
advenient
advent
Adventist
adventitious
adventure
adventurer
adventuresome
adventuress
adventurism
adventurous
adventurously
adverb
adverbial
adversarial
adversary

adulor
adulor
adulor
alo
alter
alter
alter
alter
alter
alter
alter
alter
alter
alo
umbra
umbra
uncus
uncus
uncus
uro
uro
verbum
valeo
ab/ante
ab/ante
ab/ante
ab/ante
ab/ante
ab/ante
veho
veho
venio
venio
venio
venio
venio
venio
venio
venio
venio
venio
venio
verbum
verbum
verto
verto

adversative
adverse
adversely
adversifoliate
adversity
advert
advertent
advertise
advertisement
advertiser
advertising
advice
advisability
advisable
advise
advisedly
advisement
advising
advisor
advisory
advocacy
advocate
advocatus diaboli
aedile
aedileship
aeger
aegrotat
aeneolithic
aeneous
aerate
aeration
aerator
aerial
aerie
aeriferous
aerification
aeriform
aerify
aeroplane
aerosol
aerospace
aerotrain
affability
affable
affably
affair

verto
verto
verto
verto/folium
verto
verto
verto
verto
verto
verto
verto
video
video
video
video
video
video
video
video
video
vox
vox
vox
aedes
aedes
aeger
aeger
aestimo
aestimo
aer
aer
aer
aer
area
aer/fero
aer
aer/forma
aer
planus
solvo
spatium
traho
for
for
for
facio

affaire (Fr)
affect
affectation
affected
affectedly
affecter
affection
affectional
affectionate
affectionately
affective
affectively
afferent
affianced
affiche
affidavit
affiliate
affiliation
affiliative
affinal
affination
affine
affinity
affirm
affirmable
affirmance
affirmant
affirmation
affirmative
affirmatively
affix
affixture
afflatus
afflict
affliction
affluence
affluent
afflux
afford
affricate
affricative
affront
affusion
aficionado
AFL
aflame

facio
facio
facio
facio
facio
facio
facio
facio
facio
facio
facio
facio
fero
fides
figo
fides
filius
filius
filius
finis
finis
finis
finis
firmus
firmus
firmus
firmus
firmus
firmus
firmus
figo
figo
flo
fligo
fligo
fluo
fluo
fluo
fortis
frigo
frigo
frons
fundo
facio
fides/laboro
flagro

afocal
aforementioned
a fortiori
Africa
African
Afrikaaner
Afrikaans
afro
AfroAfrocentric
Afrocentrism
aftereffect
afterimage
afternoon
aftertaste
Ag
age
aged
ageism
ageless
agelong
agency
agenda
agene
agent

focus
mens
fortis
Afer
Afer
Afer
Afer
Afer
Afer
Afer
Afer
facio
imago
novem
tango
argentum
aevum
aevum
aevum
aevum
aevum
ago
ago
aevum
ago
agent provocateur (Fr) ago/vox
aggiornomento (It) dies
agglomerate
glomus
agglomeration
glomus
agglutin
gluten
agglutinate
gluten
aggrade
gradior
aggrandize
grandis
grandis
aggrandizement
aggravate
gravis
aggravating
gravis
aggravatingly
gravis
aggravation
gravis
aggregate
grex
aggregation
grex
aggregative
grex
aggress
gradior
aggression
gradior
aggressive
gradior
aggressively
gradior
aggressiveness
gradior

aggressor
aggrieve
aggrieved
aggrievement
agile
agility
agist
agitate
agitatedly
agitation
agitato (It)
agitator
Agit-Prop
aglet
agnate
agnomen
Agnus Dei
agrarian
agrarianism
agree
agreeable
agreeably
agreement
agrestic
agribusiness
agricultural
agriculturalist
agriculture
agriculturist
agrocity
agrogorod
ague
aguish
aid
aide
aide-de-camp (Fr)
aide-memoire (Fr)
AIDS
aiguille
aiguillette
aileron
aim
aimer
aimless
aimlessly
air

gradior
gravis
gravis
gravis
ago
ago
iaceo
ago
ago
ago
ago
ago
ago/pango
acer
nascor
nomen
agnus/deus
ager
ager
gratus
gratus
gratus
gratus
ager
ager
ager/colo
ager/colo
ager/colo
ager/colo
civis
ager
acer
acer
iuvo
iuvo
iuvo/campus
iuvo/memor
quaero/munus/facio
acer
acer
ala
aestimo
aestimo
aestimo
aestimo
aer

airbag
airballon
air base
air bath
airboat
airborne
airbrake
airbrush
airbus
air-condition
aircraft
airfield
airfoil
air force
airframe
airfreight
airhead
airhole
airified
airify
airily
airiness
airlift
airline
airmail
airman
airplane
air pocket
airport
airproof
air pump
airseal
airship
airsick
airtight
airway
airworthy
airy
aisle
-al
a la (Fr)
a la carte (Fr)
alacrity
a la mode (Fr)
alar
alarm

aer
aer
aer
aer
aer
aer
aer
aer
aer/omnis
aer/dico
aer
aer
aer/folium
aer/fortis
aer
aer
aer
aer
aer
aer
aer
aer
aer
aer/linum
aer
aer
aer/planus
aer
aer/portus
aer/probus
aer
aer
aer
aer
aer
aer
aer
aer
ala
-alis
ille
ille
alacer
ille/modus
ala
arma

alarmable
alarming
alarmingly
alarmism
alarmist
alary
alas
alate
alb
alba
Alba Longa
Alban
Albania
Albanian
albarium
albatross
albedo
albedometer
albescent
albifrons
albinism
albino
Albion
album
albumen
albumin
albuminous
alburnum
alcove
alea iacta est
alegar
alert
alertly
alertness
alfresco
algae
algid
algometer
algor
alias
alibi
alien
alienable
alienage
alienate
alienation

arma
arma
arma
arma
arma
ala
lassus
ala
albus
albus
albus/longus
albus
albus
albus
albus
albus
albus
albus
albus
albus/frons
albus
albus
albus
albus
albus
albus
albus
albus
ala
iacio/sum
acer
rego
rego
rego
frigeo
algeo
algeo
algeo
algeo
alius
alius
alius
alius
alius
alius
alius

alienator
alienee
alienism
alienist
aliferous
aliform
align
aligned
alignment
aliment
alimentary
alimentation
alimentative
alimony
aliped
aliquant
aliquot
allargando (It)
allay
all-consuming
allegation
allege
allegeable
allegiance
allegiant
allegretto (It)
allegro (It)
alleviant
alleviate
alleviation
all-exclusive
alley
alleyway
alliance
allied
alligator
all-important
allision
alliterate
alliteration
alliterative
alliteratively
allocate
allocation
allocative
allocator

alius
alius
alius
alius
ala/fero
ala/forma
linum
linum
linum
alo
alo
alo
alo
alo
ala/pes
alius/quantus
alius/quot
largus
ligo
sumo
lex
lex/lis
lex/lis
lex
lex
alacer
alacer
levis
levis
levis
claudo
ambulo
ambulo
ligo
ligo
lacerta
porto
laedo
littera
littera
littera
littera
locus
locus
locus
locus

allocution
allow
allowable
allowance
alloy
all-powerful
allude
allusion
allusive
allusively
alluvial
alluviation
alluvium
ally
Alma
alma mater
Alpestrine
alpha decay
alphanumeric
alpha particle
Alpine
Alps
altar
altar boy
altarcloth
altar girl
altarpiece
altar rail
altarstone
altazimuth
alter
alter ego
alterability
alterable
alteration
altercation
alternate
alternately
alternating
alternating current
alternation
alternative
alternatively
alternativity
alternator
altigraph

loquor
laus/locus
laus/locus
laus/locus
ligo
potis
ludus
ludus
ludus
ludus
lavo
lavo
lavo
ligo
alo
alo/mater
Alpes
cado
numerus
pars
Alpes
Alpes
oleo
oleo
oleo
oleo
oleo
oleo/rego
oleo
alo
alter
alter/ego
alter
alter
alter
alter
alter
alter
alter
alter/curro
alter
alter
alter
alter
alter
alo

altimeter
altimetry
altiplanation
altiplano
altitude
alto
altocumulus
altostratus
altricial
altrigenderism
altruism
altruist
altruistic
altristically
alum (person)
alum (subst.)
aluminate
aluminiferous
aluminotype
aluminous
aluminum
alumna
alumnus
alveary
alveolar
alveolate
alveolus
A.M.
AM
AMA
Amanda
amanuensis
amateur
amateurish
amateurishly
amateurism
amative
amatory
ambagious
ambiambiance
ambidexter
ambidexterity
ambidextrous
ambience
ambient

alo
alo
alo/planus
alo/planus
alo
alo
alo/cumulus
alo/sterno
alo
alter/genus
alter
alter
alter
alter
alo
alumen
alumen
alumen/fero
alumen
alumen
alumen
alo
alo
alveus
alveus
alveus
alveus
ante/medius/dies
amplus/modus
medeor/socius
amo
manus
amo
amo
amo
amo
amo
amo
ambo/ago
ambo
ambo/eo
ambo/dexter
ambo/dexter
ambo/ dexter
ambo/eo
ambo/eo

ambiguity
ambiguous
ambiguously
ambilateral
ambisinister
ambisonic
ambit
ambition
ambitious
ambitiously
ambivalence
ambivalent
ambivalently
amble
ambry
ambs-ace
ambulance
ambulant
ambulate
ambulation
ambulator
ambulatory
AMDG
amebiform
ameliorable
ameliorant
ameliorate
amelioration
ameliorative
ameliorator
amenable
amend
amendable
amendatory
amended
amendment
amends
amenity
amentia
amer (Fr)
amerce
amercement
American Revolution

ami (Fr)
amiability
amiable

ambo/ago
ambo/ago
ambo/ago
ambo/latus
ambo/sinister
ambo/sonus
ambo/eo
ambo/eo
ambo/eo
ambo/eo
ambo/valeo
ambo/valeo
ambo/valeo
ambulo
arma
ambo/as
ambulo
ambulo
ambulo
ambulo
ambulo
ambulo
magis/gloria/deus
forma
melior
melior
melior
melior
melior
melior
minae
mendum
mendum
mendum
mendum
mendum
mendum
amo
mens
amo
merx
merx
volvo
amo
amo
amo

amiably
amicable
amicably
amice
amicus curiae
amiga (Sp)
amigo (Sp)
amiss
amity
ammo
ammunition
amnicolidae
amoral
amorally
amoretto (It)
amorous
amorously
amortization
amortize
amotivational
amount
amour (Fr)
amour propre (Fr)
ampersand
amphiparous
ample
ampliate
amplification
amplified
amplifier
amplify
amplitude
amply
ampoule
amputate
amputation
amputator
amputee
amulet
Amy
amygdaliferous
amyl acetate
anal
anally
anal retentive
anatine

amo
amo
amo
amictus
amo/curia
amo
amo
mitto
amo
moenia
moenia
amnis/colo
mos
mos
amo
amo
amo
mors
mors
moveo
mons
amo
amo/proprius
per/sui
pario
amplus
amplus
amplus
amplus
amplus
amplus
amplus
amplus
ampulla
puto
puto
puto
puto
amuletum
amo
fero
acer
anus (b.p.)
anus (b.p.)
anus/teneo
anas

-ance
ancestor
ancestorial
ancestral
ancestrally
ancestress
ancestry
ancien regime (Fr)
ancient
anciently
ancientness
ancilla
ancillary
ancipital
-ancy
andante
anfractuosity
anfractuous
anger
angina pectoris
angle
angler
angry
anguiform
angulliform
anguine
anguis in herba
anguish
angular
angularity
angulate
angulation
angustifolia
anile
anility
anima
animadversion
animadvert
animal
animalcule
animalculum
animalish
animalism
animalistic
animality
animalize

-antia
ante/cedo
ante/cedo
ante/cedo
ante/cedo
ante/cedo
ante/cedo
ante/rego
ante
ante
ante
ancilla
ancilla
caput
-antia
ambulo
ambo/frango
ambo/frango
ango
ango/pectus
ango
ango
ango
anguis/forma
anguis/forma
anguis
anguis/herba
ango
ango
ango
ango
ango
ango/folium
anus (o.w.)
anus
animus
animus/verto
animus/verto
animus
animus
animus
animus
animus
animus
animus
animus

anima mundi
animate
animated
amination
animator
anime
animism
animist
animistic
animosity
animus
annal
annalist
annalistic
annate
annelid
annelida
annex
annexation
annexationist
annexe
annihilate
annihilation
annihilationism
annihilationist
annihilator
anniversary
anno Domini
annotate
annotation
annotator
announce
announcement
announcer
annoy
annoyance
annoying
annoyingly
annual
annually
annuitant
annuit coeptis
annuity
annular
annulate
annulet

animus/mundus
animus
animus
animus
animus
animus
animus
animus
animus
animus
animus
annus
annus
annus
nascor
anus
anus
necto
necto
necto
necto
nihil
nihil
nihil
nihil
nihil
annus/verto
annus/domus
nosco
nosco
nosco
nuntio
nuntio
nuntio
odi
odi
odi
odi
annus
annus
annus
nuo/aptus
annus
annus
anus
anus

annull
an(n)ular
annularity
annulate
annulet
annullment
annunciate
annunciation
annunciator
anoint
anointment
anorectal
anovulent
ansa
ansate
anserine
anserous
-ant
antacid
ante
ante bellum
antecede
antecedence
antecedent
antecessor
antechamber
antedate
antediluvial
antediluvian
antefebrile
antefix
anteflexion
antelabrum
antelocation
antemeridian
ante meridiem
ante mortem
antenatal
antenate
antenna
antennary
antennule
antenuptial
antepartum
antepenult
antepenultimate

ullus
anus
anus
anus
anus
ullus
nuntio
nuntio
nuntio
unguo
unguo
anus/rego
ovum
ansa
ansa
anser
anser
-ans, -ant
acer
ante
ante/bellum
ante/cedo
ante/cedo
ante/cedo
ante/cedo
ante
ante/do
ante/lavo
ante/lavo
ante/febris
ante/figo
ante/flecto
ante/labium
ante/locus
ante/medius/dies
ante/medius/dies
ante/mors
ante/nascor
ante/nascor
antenna
antenna
antenna
ante/nubo
ante/pario
ante/paene/ultra
ante/paene/ultra

anteprandial
ante rem
anterior
anteroom
anteroposterior
anteversion
Anthony
anti-abortion
antiaircraft
antic
anticipate
anticipation
anticipative
anticipatively
anticipatory
anticoagulant
anticolonial
anticolonialism
anticolonialist
anti-communism
anti-communist
anticompetitive
anticonvulsant
anti-corrosive
antics
antidepressant
antidiscrimination
antiexpansionism
antifascist
antifederalist
antifeminist
anti-Gallic
antigravity
anti-inflammatory
antilabor
antimarriage
antimatter
antinatural
anti-negro
antineutrino
antinodal
antinode
antiparticle
antipersonnel
antiperspirant
antiprotectionist

ante/prandium
ante/res
ante
ante
ante/post
ante/verto
Antonius
orior
aer
ante
ante/capio
ante/capio
ante/capio
ante/capio
ante/capio
ago
colo
colo
colo
munus
munus
peto
vello
rodo
ante
premo
cerno
pando
fascis
fides
femina
Gallia
gravis
flagro
laboro
maritus
mater
nascor
niger
uter
nodus
nodus
pars
persona
spiro
tego

antiquarian
antiquary
antiquated
antique
antiquity
antireligion
antireligious
antiserum
antisocial
antisocially
antisubmarine
antisuffragist
antiterror
antiterrorist
antitussive
antiunion
antivenereal
antivenom
antiviolence
antivirus
Antonette
Antony
antrorse
anular
anus
anxiety
anxious
anxiously
Anzac
apace
aparejo (Sp)
apart
apartheid
apartment
apartness
apercu
aperient
aperitif
aperitive
aperture
apex
apian
apiarian
apiarist
apiary
apicaceous

ante
ante
ante
ante
ante
ligo
ligo
serum
socius
socius
mare
suffrago
terreo
terreo
tussis
unus
veneror
venenum
vis
virus
Antonius
Antonius
verto
anus
anus
ango
ango
ango
auster
pando
paro
pars
pars
pars
pars
capio
aperio
aperio
aperio
aperio
apex
apis
apis
apis
apis
apis

apical
apicide
apicultural
apiculturalist
apiculture
apiculturist
apiotherapy
apivorous
aplomb
apostil
a posteriori
appall
appalled
appalling
appanage
apparat
apparatchik
apparatus
apparel
apparent
apparently
apparition
apparitor
appeal
appealable
appealing
appealingly
appear
appearance
appeasable
appease
appeasement
appellant
appellate
appellation
appellative
append
appendage
appendant
appendectomy
appendicitis
appendicular
appendix
apperceive
apperception
appertain

apex
apis/caedo
apis/colo
apis/colo
apis/colo
apis/colo
apis
apis/voro
plumbum
pono/ille
post
palleo
palleo
palleo
panis
paro
paro
paro
par
pareo
pareo
pareo
pareo
pello
pello
pello
pello
pareo
pareo
pax
pax
pax
pello
pello
pello
pello
pendo
pendo
pendo
pendo
pendo
pendo
pendo
capio
capio
teneo

appetency
appetible
appetite
appetizer
appetizing
applaud
applaudable
applause
apple polisher
applesauce
appliable
appliance
applicable
applicant
application
applied
applique
appliquer
apply
appoint
appointee
appointer
appointive
appointment
appointor
apportion
apportionment
apposite
apposition
appositive
appraisal
appraise
appraiser
appreciable
appreciably
appreciate
appreciation
appreciative
appreciatively
appreciator
apprehend
apprehensible
apprehension
apprehensive
apprehensively
apprentice

peto
peto
peto
peto
peto
plaudo
plaudo
plaudo
polio
sal
plecto
plecto
plecto
plecto
plecto
plecto
plecto
plecto
plecto
pungo
pungo
pungo
pungo
pungo
pungo
pars
pars
pono
pono
pono
pretium
pretium
pretium
pretium
pretium
pretium
pretium
pretium
pretium
pretium
prehendo
prehendo
prehendo
prehendo
prehendo
prehendo

apprenticeship
apprise
approach
approachable
approbate
approbation
approbative
approbator
approbatory
appropriate
appropriately
appropriation
appropriator
approval
approve
approvingly
approximate
approximately
approximation
appulse
appurtenance
appurtenant
apricot
April
a priori
apriorism
apriority
apron
apron-string
apropos
apt
aptitude
aptly
aptness
aqua
aquabib
aquacade
aquaculture
aqua fortis
aqualung
aquamarine
aquanaut
aquaplane
aqua regia
aquarelle
aquarellist

prehendo
prehendo
prope
prope
probus
probus
probus
probus
probus
proprius
proprius
proprius
proprius
probus
probus
probus
prope
prope
prope
pello
teneo
teneo
coquus
aperio
prior
prior
prior
mappa
mappa
pono
aptus
aptus
aptus
aptus
aqua
aqua/bibo
aqua/cado
aqua/colo
aqua/fortis
aqua
aqua/mare
aqua
aqua/planus
aqua/rego
aqua
aqua

aquarian
aquarium
Aquarius
aquatic
aquatint
aquavit
aqua vita
aqueduct
aqueous
aquiclude
aquiculture
aquifer
aquiform
Aquila
aquiline
aquosity
-ar
arable
arability
araneid
araneidan
araneiform
aranology
aration
arational
arbiter
arbiter bibendi
arbitrable
arbitrage
arbitral
arbitrament
arbitarily
arbitrariness
arbitrary
arbitrate
arbitration
arbitrational
arbitrator
arbitress
arbor
arboreal
arboreally
arborescent
arboret
arboretum
arboricidal

aqua
aqua
aqua
aqua
aqua/tingo
aqua/vivo
aqua/vivo
aqua/duco
aqua
aqua/claudo
aqua/colo
aqua/fero
aqua/forma
aquila
aquila
aqua
-aris
aro
aro
aranea
aranea
aranea/forma
aranea
aro
reor
arbiter
arbiter/bibo
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbiter
arbor
arbor
arbor
arbor
arbor
arbor
arbor/caedo

arboricide
arboricolous
arboriculture
arborist
arborway
arbour
arbuscle
arc
arcade
arcane
arcanist
arcanum
arch
arched
archducal
archduke
archenemy
archer
archery
archimage
architrave
archway
arciform
arc-lamp
arcosolium
arcuate
ardency
ardent
ardently
ardor
arduous
arduously
area
areal
arear
arearage
arears
arena
arenaceous
arenation
arenicolous
areola
areolar
areolate
areolation
argent

arbor/caedo
arbor/colo
arbor/colo
arbor
arbor
herba
arbor
arcus
arcus
arceo
arceo
arceo
arcus
arcus
duco
duco
amo
arcus
arcus
imago
arcus/trabs
arcus
arcus/forma
arcus
arcus/sedeo
arcus
ardeo
ardeo
ardeo
ardeo
arduus
arduus
area
area
retro
retro
retro
arena
arena
arena
arena/colo
area
area
area
area
argentum

argentiferous
Argentina
argentine
Argentinean
argentophil
argentophilic
argillaceous
argillite
arguable
arguably
argue
argument
argumentation
argumentative
argumentatively
argute
aria
arid
aridity
aridly
aridness
Aries
arithmetic mean

argentum/fero
argentum
argentum
argentum
argentum
argentum
argilla
argilla
arguo
arguo
arguo
arguo
arguo
arguo
arguo
arguo
aer
areo
areo
areo
areo
aries
medius
arithmetic progression gradior
-arium
-arium
ark
arceo
arm (body part)
arma
arm (v)
arma
armada
arma
armadillo
arma
armament
arma
armature
arma
armiger
arma/gero
armigerous
arma/gero
armistice
arma/sto
armoire
arma
armor
arma
armor-bearer
arma
armored
arma
armorer
arma
armorial
arma
armory
arma
armpit
puteus
arms (war)
arma
army
arma
around
rota

arraign
arraignment
arrant
array
arrest
arrestee
arresting
arrival
arrive
arriviste
arrogance
arrogant
arrogantly
arrogate
arrow
arse
arse
arsenal
arson
arsonist
art
artefact
artful
artfully
article
articulacy
articular
articulate
articulation
artifact
artfice
artificer
artificial
artificiality
artificially
artillerist
artillery
artisan
artist
artiste
artistic
artistically
artistry
artless
artlessly
arty

reor
reor
erro
radius
sto
sto
sto
ripa
ripa
ripa
rogo
rogo
rogo
rogo
radius
ars
asinus
arma
ardeo
ardeo
ars
ars/facio
ars
ars
artus
artus
artus
artus
artus
ars/facio
ars/facio
ars/facio
ars/facio
ars/facio
ars/facio
ars
ars
ars
ars
ars
ars
ars
ars
ars
ars
ars

arundinaceous
arval
arviculture
-ary
asafetida
ascend
ascendancy
ascendant
ascender
ascension
ascensive
ascent
ascertain
ascertainable
ASCII
ascribable
ascribe
ascription
ascriptive
asexual
asexually
asinine
asocial
aspect
asper (grammar)
asperate
asperge
asperity
asperse
aspersion
asperous
aspirant
aspirate
aspiration
aspirator
aspire
aspiring
aspiringly
asportation
ass (b.p.)
ass (animal)
assail
assailable
assailant
assailer
assault

arundo
arvum
arvum/colo
-arium
feteo
scando
scando
scando
scando
scando
scando
scando
cerno
cerno
teneo/codex/forma/cambio

scribo
scribo
scribo
scribo
sexus
sexus
asinus
socius
specio
asper
asper
spargo
asper
spargo
spargo
asper
spiro
spiro
spiro
spiro
spiro
spiro
spiro
porto
asinus
asinus
salio
salio
salio
salio
salio

assaultable
assaultive
assay
assemblage
assemble
assembler
assembly
assemblyline
assemblyman
assent
assenter
assentor
assert
assertable
asserter
assertion
assertive
assertively
assertor
assertory
assess
assessable
assessee
assession
assessment
assessor
assessory
asset
asseverate
asseveration
assibilate
assibilation
assiduity
assiduous
assiduously
assign
assignability
assignable
assignat
assignation
assignee
assigner
assignment
assignor
assimilability
assimilable

salio
salio
ago
simul
simul
simul
simul
simul/linum
simul
sentio
sentio
sentio
sero
sero
sero
sero
sero
sero
sero
sero
sedeo
sedeo
sedeo
sedeo
sedeo
sedeo
sedeo
satis
severus
severus
sibilus
sibilus
sedeo
sedeo
sedeo
signum
signum
signum
signum
signum
signum
signum
signum
signum
simul
simul

assimilate
assimilation
assimilationism
assimilationist
assimilationistic
assimilative
assimilator
assist
assistance
assistant
assistantship
assister
assistor
assize
assizer
assizor
asslike
associability
associable
associate
association
associational
associative
associator
assonance
assonant
assonate
assort
assortative
assorted
assorter
assortment
assuage
assuagement
assuasive
assumable
assume
assumer
assumpsit
assumption
assumptive
assurance
assurant
assure
assured
assuredly

simul
simul
simul
simul
simul
simul
simul
sto
sto
sto
sto
sto
sto
sedeo
sedeo
sedeo
asinus
socius
socius
socius
socius
socius
socius
socius
sonus
sonus
sonus
sors
sors
sors
sors
sors
suavis
suavis
suadeo
sumo
sumo
sumo
sumo
sumo
sumo
cura
cura
cura
cura
cura

assuredness
assurer
assurgent
assuror
astonish
astonishing
astonishingly
astonishment
astound
astounding
astray
astrict
astrictive
astringe
astringency
astringent
astrodome
astrogator
astronavigation
astronavigator
astucious
astuciously
astucity
astute
astutely
astuteness
atavic
atavism
atavistic
-ate
Atlantic City
atone
atonement
atrabilious
atrament
atriopore
atrium
atrocious
atrociously
atrocity
attain
attainability
attainable
attainder
attainer
attainment

cura
cura
rego
cura
tono
tono
tono
tono
tono
tono
vagus
stringo
stringo
stringo
stringo
stringo
domus
ago
navis/ago
navis/ago
astus
astus
astus
astus
astus
astus
avus
avus
avus
-atus
civis
unus
unus
ater/bilis
ater
ater
ater
ater
ater
ater
tango
tango
tango
tango
tango
tango

attainor
attaint
attempt
attemptable
attempter
attemptor
attend
attendance
attendant
attendee
attender
attention
attentive
attentively
attently
attenuate
attenuating
attenuation
attenuator
attest
attestable
attestation
attitude
attitudinal
attract
attraction
attractive
attractively
attractiveness
attractor
attributable
attribute
attribution
attributive
attributively
attrited
attrition
Au
aubade
auburn
AUC
au contraire
au courant
auction
auctioneer
audace (It)

tango
tango
tempto
tempto
tempto
tempto
tendo
tendo
tendo
tendo
tendo
tendo
tendo
tendo
tendo
tenuis
tenuis
tenuis
tenuis
testis
testis
testis
aptus
aptus
traho
traho
traho
traho
traho
traho
tribus
tribus
tribus
tribus
tribus
tero
tero
aurum
albus
albus
urbs/condo
contra
curro
augeo
augeo
audeo

audacious
audaciously
audacity
audible
audibility
audibly
audience
audile
audio
audiogram
audiometer
audiophile
audiotape
audiovisual
audit
audition
auditor
auditorium
auditory
augend
auger
augment
augmentation
augmentative
augur
augury
Augsburg
august
August
Augusta
Augustan
Augustine
Augustinian
Augustus
au naturel (Fr)
aunt
aunty
au pair (Fr)
aural
aurea
aurea mediocritas
aureate
aureity
Aurelia
aurelian
aureola

audeo
audeo
audeo
audio
audio
audio
audio
audio
audio
audio
audio
audio
audio
audio/video
audio
audio
audio
audio
audio
augeo
avis/gero
augeo
augeo
augeo
avis/gero
avis/gero
augeo
augeo
augeo
augeo
augeo
augeo
augeo
augeo
nascor
amita
amita
par
audio
aurum
aurum/medius/ocris
aurum
aurum
aurum
aurum
aurum

aureole
aureomycin
auricle
auricular
auriculate
auriferous
aurification
aurify
Auriga
auriscope
aurora
aurora australis
aurora borealis
auroral
aurous
aurulent
auscultate
auscultation
auscultatory
auspicate
auspices
auspicious
auspiciously
Auster
austral
Australia
Australian
Australoid
Australopithecus
Austria
author
authoress
authoritarian
authoritarianism
authoritative
authoritatively
authority
authorization
authorize
authorship
autoclave
auto-correllated
auto-correllation
auto-de-fe (Pg)
autodestructive
autodial

aurum
aurum
audio
audio
audio
aurum/fero
aurum
aurum
Auriga
audio
aurora
aurora/auster
aurora
aurora
aurum
aurum
audio/clueo
audio/clueo
audio/clueo
avis/specio
avis/specio
avis/specio
avis/specio
auster
auster
auster
auster
auster
auster
auster
augeo
augeo
augeo
augeo
augeo
augeo
augeo
augeo
augeo
augeo
claudo
fero
fero
ago/fides
struo
dies

autoimmune
automobile
automobilism
automobilist
automobility
automotive
autostrada
autumn
autumnal
autumnal equinox
autumny
auxilian
auxiliar
auxiliary
auxin
auxospore
auxotroph
avail
availability
available
availing
availingly
avalanche
avalvular
avant-garde
avarice
avaricious
avariciously
avascular
Ave
Ave Maria
avenaceous
avenge
avenger
aveniform
aventurine
avenue
aver
average
averment
averse
aversely
aversion
aversive
avert
avian

munus
moveo
moveo
moveo
moveo
moveo
sterno
autumnus
autumnus
autumnus/aequus/nox

autumnus
augeo
augeo
augeo
augeo
augeo
augeo
valeo
valeo
valeo
valeo
valeo
labor
valvae
ab/ante
aveo
aveo
aveo
vas
aveo
aveo
avena
vindex
vindex
avena/forma
venio
venio
verus
habeo
verus
verto
verto
verto
verto
verto
avis

aviarist
aviary
aviate
aviation
aviator
aviatrix
avicide
avicolous
aviculture
aviculturist
avid
avidity
avidly
avifauna
avine
avionics
aviophobia
Avis
avocation
avocational
avoid
avoidable
avoidance
avoider
avoirdupois
avolitional
avouch
avow
avowable
avowal
avowedly
avower
avowry
avulsion
avuncular
avuncularism
avuncularity
avuncularly
avunculate
AWACS
awe-inspiring
axial
axil
axillary
axis
axle

avis
avis
avis
avis
avis
avis
avis/caedo
avis/colo
avis/colo
avis/colo
aveo
aveo
aveo
avis/Faunus
avis
avis
avis
avis
vox
vox
vaco
vaco
vaco
vaco
habeo/pendo
volo
vox
vox
vox
vox
vox
vox
vox
vello
avus
avus
avus
avus
avus
aer/rota
spiro
axis
ala
ala
axis
axis

axunge

unguo

B
Derivative
baby-farm
baccalaureate
baccate
bacciferous
bacciform
baccivorous
bachelor
bacilliform
backcountry
backcourt
backcross
back-formation
backline
back page
backpedal
backspace
backstage
bactericidal
bactericide
baculiform
bagasse
bagatelle
bagnio
bagpipe
bail

Source
firmus
baca/laurus
baca
baca/fero
baca/forma
baca/voro
baca
forma
contra
cohors
crux
forma
linum
pagina
pes
spatium
sto
caedo
caedo
forma
baca
baca
balneum
pipo
baiulus

bailiff
bailiwick
bailment

baiulus
baiulus
baiulus

baking powder
balance
balancer
balbutient
balbuties
balkline
balladmonger
ballpoint
balneal
balneation
balneological
balneologist
balenology
balneotherapy
balsamiferous
banknote
bankroll
bankrupt
bankruptcy
barb
Barbados
barbarian
barbate
barbative
barbed
barbel
barbellate
barber
barbershop
barbet
barbule
Barcelona
barefaced
barbicel
bartender
barouche
base (evil)
baseline
BASIC
Basque
bas-relief
bass (low, evil)

pulvis
bis/lanx
bis/lanx
balbus
balbus
linum
mango
pungo
balneus
balneus
balneus
balneus
balneus
balneus
fero
nosco
rota
rumpo
rumpo
barba
barba
barba
barba
barba
barba
barba
barba
barba
barba
barba
barba
Barca
facio
barba
tendo
bis/rota
bassus
linum
codex/struo
Vesco
bassus/levis
bassus

basset
bassinet
basso
bassoon
bassoonist
bat (not animal)
bated
Baton Rouge
battalion
batter
battering-ram
battery
battle
battle-ax
battledore
battledress
battlefield
battlefront
battleground
battleline
battlement
battleship
battlesome
bay
bayberry
Bea
beard
beast
beastliness
beastly
beatific
beatification
beatify
beatitude
Beatrice
beau
beauteous
beautician
beautification
beautifier
beautiful
beautifully
beautify
beauty
beaux
because

bassus
bassus
bassus
bassus
bassus
battuo
battuo
ruber
battuo
battuo
battuo
battuo
battuo
battuo
battuo
battuo/rego
battuo
battuo/frons
battuo
battuo/linum
battuo
battuo
battuo
baia
baca
bonus
barba
bestia
bestia
bestia
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
bonus
causa

bedaub
bed-linen
bedpost
beef
beefcake
beef cattle
beef eater
beefsteak
beefy
beeline
beer
beerparty
beet
begaud
begem
begemmed
behave
bejewel
bel
belabor
belaud
beldam(e)
beleaguered
beletter
Belgian
Belgium
bell
bell
belladonna
Bellatrix
belle
belles lettres (Fr)
belletrism
belletrist
belletristic
Belleville
bellicose
bellicosely
bellicosity
belligerence
belligerency
belligerent
belligerently
bellipotent
bellow
bellypork

albus
linum
postis
bos
bos
bos/caput
bos
bos
bos
linum
bibo
bibo/pars
beta
gaudeo
gemma
gemma
habeo
iocus
bonus
laboro
laus
bonus
ligo
littera
Belgae
Belgae
bellum
bonus
bonus/domus
bellum
bonus
bonus/littera
bonus/littera
bonus/littera
bonus/littera
bonus/villa
bellum
bellum
bellum
bellum/gero
bellum/gero
bellum/gero
bellum/gero
bellum/potis
bellum
porcus

belt
belting
belt line
belvedere
Benedict
Benedictine
benediction
benedictive
benedictory
benefaction
benefactive
benefactor
benefactress
benefactrix
benefice
beneficence
beneficent
beneficently
beneficial
beneficially
beneficiary
beneficiate
benefit
benefiter
Benelux
benevolence
benevolent
benevolently
benign
benignancy
benignant
benignity
benignly
benison
berate
berate
besiege
besieger
bespectacled
bestial
bestiality
bestialize
beastially
bestiarian
bestiary
beta decay

balteus
balteus
balteus/ linum
bonus/video
bonus/dico
bonus/dico
bonus/dico
bonus/dico
bonus/dico
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus/facio
bonus
bonus/volo
bonus/volo
bonus/volo
bonus/genus
bonus/genus
bonus/genus
bonus/genus
bonus/genus
bonus/dico
puto
reor
sedeo
sedeo
specio
bestia
bestia
bestia
bestia
bestia
bestia
cado

beta particle
beta ray
bete-noire (Fr)
betray
betrayal
betrayer
beverage
bevy
biannual
biannually
biarticular
bias
biathlon
biauricular
bib
bibaceous
bibber
bibulate
bibulosity
bibulous
bicameral
bicarbonate
bicaudal
bicaudate
bicentenary
bicentennial
bicentral
bicephalous
biceps
bichloride
bichromate
biciliate
bicipital
bicolligate
bicolor
biconcave
biconical
biconjugate
bicorn
bicorporal
bicrural
bicultural
bicuspid
bicycle
bicyclist
bident

pars
radius
bestia/niger
do
do
do
bibo
bibo
bis/annus
bis/annus
bis/artus
bis/facio
bis
bis/audio
bibo
bibo
bibo
bibo
bibo
bibo
bis
bis/carbo
bis/cauda
bis/cauda
bis/centum
bis/centum/annus
bis
bis
bis/caput
bis
bis
bis/cilium
bis/caput
bis/ligo
bis/color
bis/cavus
bis
bis/iungo
bis/cornu
bis/corpus
bis/crus
bis/colo
bis/cuspis
bis
bis
bis/dens

bidental
bidentate
bidialecticist
bidirectional
biennial
biennially
biennium
bifacial
bifarious
biferous
bifid
bifilar
biflagellate
biflorous
bifocal
bifoliate
biforate
biform
bifront
bifurcate
bifurcation
bigamist
bigamous
bigamy
bigeneric
big mo
bike
biker
bilabial
bilabiate
bilamellar
bilateral
bilateralism
bilateralist
bilaterally
bile
bilinear
bilingual
bilingualism
bilious
biliously
biliousness
bilirubin
biliteral
bill
billable

bis/dens
bis/dens
bis
bis/rego
bis/annus
bis/annus
bis/annus
bis/facio
bis/for
bis/fero
bis/findo
bis/filum
bis/flagrum
bis/flos
bis/focus
bis/folium
bis/foro
bis/forma
bis/frons
bis/furca
bis/furca
bis
bis
bis
bis/genus
moveo
bis
bis
bis/labium
bis/labium
bis/lamina
bis/latus
bis/latus
bis/latus
bis/latus
bilis
bis/linum
bis/lingua
bis/lingua
bilis
bilis
bilis
bilis/ruber
bis/littera
bulla
bulla

billboard
billet
billet-doux (Fr)
billiards
billion
billionaire
billionth
bilocate
bilocation
bilocular
biloculine
biluria
bimaculate
bimanous
bimedian
bimensal
bimester
bimestrial
bimetallic
bimetallism
bimillenary
bimodal
bimolecular
bi-monthly
binary
binational
binaural
binnacle
binocular
binomial
binuclear
binucleate
bioactive
bioaugmentation
bio-availability
biocide
biocontrol
biodata
biodefense
biodegradable
biodiversity
bioengineer
bioengineering
bio-enhanced
bioexclusivity
bioform

bulla
bulla
bulla/dulcis
bulla
bis
bis
bis
bis/locus
bis/locus
bis/locus
bis/locus
bilis
bis/macula
bis/manus
bis/medius
bis/mensis
bis/mensis
bis/mensis
bis
bis
bis/mille
bis/modus
bis/moles
bis
bis
bis/nascor
bis/audio
habeo
bis/oculus
bis/nomen
bis/nux
bis/nux
ago
augeo
valeo
caedo
rota
do
-fendo
gradior
verto
genus
genus
alo
claudo
forma

bioinformatics
bioluminescence
bioluminescent
biomedical
biomemory
biomolecular
biomutation
biopesticide
biordinal
bioreactor
biosafe
biosafety
biosatellite
bioscience
biosensor
biosolid
biostatistics
bioterror
bioterrorism
bioturbation
bipalmate
biparental
biparietal
biparous
bipartisan
bipartite
bipatent
biped
bipedal
bipedality
bipeltate
bipennate
bipenniform
biphyletic
bipinnate
biplanar
biplane
bipod
bipolar
bipolarity
bipotent
biquadrate
biquadratic
biquintile
biradial
biradiate

forma
lux
lux
medeor
memor
moles
muto
pestis/caedo
bis/ordo
ago
salvus
salvus
satelles
scio
sentio
solidus
sto
terreo
terreo
turba
bis/palma
bis/pario
bis/paries
bis/pario
bis/pars
bis/pars
bis/pando
bis/pes
bis/pes
bis/pes
bis
bis/pinna
bis/penna/forma
bis
bis/pinna
bis/planus
bis/planus
bis
bis
bis
bis/potis
bis/quattuor
bis/quattuor
bis/quinque
bis/radius
bis/radius

biramous
birational
bird-cage
bireme
birostrate
birotation
birth control
birth rate
biscotti (It)
biscuit
biscutate
bisect
bisection
bisectional
bisector
biserial
biserrate
bisexual
bisexuality
bison
bisonant
bisontine
bissextile
bisulcate
bisymmetrical
bit (computer)
bitangent
bitemporal
bitheism
bitonality
bitumen
bituminous
biuncinate
bivalence
bivalent
bivalve
bivalvore
bivariant
bivariate
biventral
biverbal
bivious
bivittate
bivium
bivocal
biweekly

bis/ramus
reor
cavus
bis/ramus
bis/rostrum
bis/rota
rota
reor
bis/coquus
bis/coquus
bis/scutum
bis/seco
bis/seco
bis/seco
bis/seco
bis/sero
bis/serra
bis/sexus
bis/sexus
bison
bis/sonus
bison
bis/sex
bis/sulcus
bis
bis/digitus
bis/tango
bis/tempus
bis
bis
bitumen
bitumen
bis/uncus
bis/valeo
bis/valeo
bis/valvae
bis/valvae/voro
bis/varius
bis/varius
bis/venter
bis/verbum
bis/via
bis/vitta
bis/via
bis/vox
bis

bizygomatic
blackface
black-letter
blackmarket
black Mass
Blacksox
bland
blandishment
blandly
blank verse
blaxploitation
bless
blood money
blood poisoning
blood pressure
blowpipe
blue-collar
bluejay
bluejeans
blue line
blueprint
boa
boa constrictor
boil
boiler
boldface
bona fide
bonanza
Bonaparte
Bonaventure
bonbon
bone
boner
bonfire
bong
bonhomie
bonhomous
Boniface
bonification
bon jour (Fr)
bon mot (Fr)
bonny
bon soir (Fr)
bonus
bon vivant (Fr)
bon viveur (Fr)

bis
facio
littera
merx
mitto
soccus
blandus
blandus
blandus
verto
plecto
bonus
moneo
poto
premo
pipo
collum
Gaius
Genua
linum
premo
boa
boa/stringo
bulla
bulla
facio
bonus/fides
bonus
bonus/pars
bonus/venio
bonus
bonus
bonus
bonus
bonus
bonus/homo
bonus/homo
bonus/facio
bonus
bonus/dies
bonus/muttio
bonus
bonus/serus
bonus
bonus/vivo
bonus/vivo

bon voyage
boob (person)
booby
booby hatch
booby prize
booby trap
bookcase
bookmobile
bookstore
boom
boon (adj)
boon (n)
boondoggle
borderline
boron
bottomline
botuliform
botulism
bouillion
bound
bounteous
bounteously
bountiful
bountifully
bounty
bovine
bovinity
bowel
bowl (cup)
bowl (vb)
bowler
bowline
bowling
box car
box office
boy scout
bracket
bract
bracteole
bracteose
bread line
Breton
breve
brevet
breviary
brevier

bonus/via
balbus
balbus
balbus
balbus/prehendo
balbus
capsa
moveo
-stauro
bombus
bonus
bonus
bonus
linum
carbo
linum
botulus/forma
botulus
bulla
unda
bonus
bonus
bonus
bonus
bonus
bos
bos
botulus
bulla
bulla
bulla
linum
bulla
carrus
facio
audio/clueo
bracae
bractea
bractea
bractea
linum
Britanni
brevis
brevis
brevis
brevis

brevilingual
breviloquent
breviped
brevipennate
brevirostral
brevirostrate
brevity
brew
brewmaster
bridge
brief
briefcase
briefing
briefly
Britain
Britannia
British
Briton
Brittany
broncoconstrictor
brumal
brume
brumous
brutal
brutality
brutalization
brutalize
brutally
brute
brutish
brutism
brutist
Brutus
bubble
bubbler
buccal
buccally
buccaneer
buccinator
buccolingual
buckle
buckled
buckler
budge
budget
budgetary

brevis/lingua
brevis/loquor
brevis/pes
brevis/pinna
brevis/rostrum
brevis/rostrum
brevis
bibo
magis
brevis
brevis
brevis/capsa
brevis
brevis
Britanni
Britanni
Britanni
Britanni
Britanni
stringo
brevis
brevis
brevis
brutus
brutus
brutus
brutus
brutus
brutus
brutus
brutus
brutus
brutus
bulla
bulla
bucca
bucca
bucca
bucca
bucca/lingua
bucca
bucca
bucca
bulla
bulga
bulga

budgeter
buena sera (It)
buenos (Sp)
Buenos Aires
bugle
bugler
bulge
bull (papal)
bulla
bullet
bulletin
bulletinize
bulliform
bullion
burb(s)
burgeon
burglar
burlap
bursiform
bus
bush-league
businessperson
bust (statue)
buttercup
buzzard
by-line
bypass
bypatent
byproduct
byte

bulga
bonus/serus
bonus
bonus/aer
bos
bos
bulga
bulla
bulla
bulla
bulla
bulla
forma
bulla
urbs
burra
latro
burra
forma
omnis
ligo
persona
bustum
cupa
buteo
linum
pando
pando
duco
bis/digitus

C
Derivative
c.
ca.
cab
caballine
caballero
cabana
cabbage
cabbage-eater
cabbage-flower
cabbage-plant
cabbing
cabby
cabdriver
cabin
cabinet
cabinetry
cable
cable-car
cablegram

Source
circum
circum
caper
caballus
caballus
capanna
caput
caput
caput/flos
caput/planta
caper
caper
caper
capanna
capanna/cavus
capanna/cavus
capio
capio/carrus
capio

cablegraph
cabler
cabless
cabling
cabman
cabochon
cabouche
cabosh
cabriole
cabriolet
cacafuego
cache
cachepot
cachet
cachinnate
cachinnation
cachinnator
cachinnatory
cad
cadastral
cadastre
cadaver
cadaverous
caddie
caddy
cadence
cadent
cadential
cadenza
cadet
cadetship
cadge
cadre
caducicorn
caducity
caducous
caecum
Caesar
Caesarian
Caesarism
Caesaro-papism
caesium
caesura
cage
cageling
cager

capio
capio
caper
capio
caper
caput
caput
caput
caper
caper
caco/focus
ago
ago
ago
cachino
cachino
cachino
cachino
caput
caput
caput
cado
cado
caput
caput
cado
cado
cado
cado
caput
caput
cavus
quattuor
cado/cornu
cado
cado
caecus
Caesar
Caesar
Caesar
Caesar
caelum
caedo
cavus
cavus
cavus

cage-work
cag(e)y
cahoots
caisson
caitiff
cajole
cajolery
Calabria
Calabrian
calate
calamitous
calamitously
calamity
calcaneal
calcar
calcareous
calcariferous
calcariform
calceate
calceiform
calceus
calciferous
calcific
calcification
calciform
calcifuge
calcify
calcigenous
calcigerous
calcination
calcine
calciphilous
calciphobous
calcite
calcium
calculability
calculable
calculate
calculation
calculator
calculiform
calculfrage
calculist
calculous
calculus
caldarium

cavus
cavus
capanna
capsa
capio
cavea
cavea
Calabria
Calabria
Kalendae
calamitas
calamitas
calamitas
calx
calx
calx
calx/fero
calx/forma
calx
calx/forma
calx
calx
calx
calx
calx/forma
calx/fugio
calx
calx
calx/gero
calx
calx
calx
calx
calx
calx
calx
calx
calx
calx/fero
calx/fero
calx/forma
calx/frango
calx
calx
calx
caleo

caldera
caldron
Caledonia
Caledonian
calefacient
calefaction
calefactory
calendar
calends
calenture
calescence
calescent
caliche
caliciform
caliginous
calk
callidity
callosity
callous
callously
callow
callus
Calor
calorescence
caloric
caloricity
calorie
calorific
calorimeter
calorimetric
calorimetry
calque
calumniate
calumniator
calumnious
calumniously
calumny
calvaria
Calvary
Calvin
Calvinism
Calvinist
Calvinistic
calvity
calx
cambium

caleo
caleo
Caledonia
Caledonia
caleo
caleo
calx
Kalendae
Kalendae
caleo
caleo
caleo
calx (lime)
forma
caligo
calx (heel)
callidus
callum
callum
callum
calvus
callum
caleo
caleo
caleo
caleo
caleo
caleo
caleo
caleo
caleo
calx (heel)
calumnia
calumnia
calumnia
calumnia
calumnia
calvus
calvus
calvus
calvus
calvus
calvus
calvus
calx
cambio

camcorder
camouflage
camp
Campagna
campaign
campaigner
campana
Campania
campaniform
campanile
campanologist
campanology
campanula
camper
campesino
campestral
campfire
camp-follower
campground
campimeter
campo
campodeiform
campsite
campus
Campus Martius
canaille
canaliferous
canaliform
canary
Canary Islands
cancan
cancel
cancellate
cancellation
cancelli
cancellous
cancer
cancerous
cancerously
cancriform
cancrine
cancrivorous
cancroid
candela
candelabrum
candent

cor
caleo
campus
campus
campus
campus
campana
campus
campana/forma
campana
campana
campana
campana
campus
campus
campus
campus
campus
campus
campus
campus
forma
campus/sino
campus
campus/Mars
canis
fero
forma
canis
canis
quamquam
cancelli
cancelli
cancelli
cancelli
cancelli
cancer
cancer
cancer
cancer/forma
cancer
cancer/voro
cancer
candeo
candeo
candeo

candescent
candid
candidacy
candidate
candidature
candidly
candidness
candle
candlelight
candlepower
candlestick
candlewick
candor
canepin
canescent
canicide
canicular
canine
Canis Major
Canis Minor
canivorous
canker
cankerous
cankerworm
canophilia
canorous
cant
cantabile
cantata
cantatory
cantatrice
canticle
cantillate
cantilever
canto
cantor
canzone
cap
capability
capable
capably
capacious
capacitance
capacitate
capacitation
capacitive

candeo
candeo
candeo
candeo
candeo
candeo
candeo
candeo
candeo
candeo/potis
candeo
candeo
candeo
pinna
candeo
canis/caedo
canis
canis
canis/magis
canis/minor
canis/voro
cancer
cancer
cancer
canis
cano
cano
cano
cano
cano
cano
cano
cano
levis
cano
cano
cano
cappa (see OED)
capio
capio
capio
capio
capio
capio
capio
capio

capacitor
capacity
caparison
cape (hood)
cape (land)
capeador
Capella
caper
capicitance
capillaceous
capillarity
capillary
capilliform
capillose
capita
capital
capitalism
capitalist
capitalistic
capitalization
capitalize
capitally
capitate
capitatim
capitation
capitative
capitol
capitulant
capitular
capitulary
capitulate
capitulation
capitulationism
capitulationist
capitulator
capitulum
capo (It)
capon
cappucchino
Capreae
Capri
capric
capriccio
caprice
capricious
capriciously

capio
capio
cappa
cappa
caput
cappa
caper
caper
capio
capillus
capillus
capillus
capillus/forma
capillus
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
caput
capo
cappa
caper
caper
caper
caper
caper
caper
caper

capriciousness
Capricornus
caprification
capriform
caprigenous
caprine
capriole
caps
capsheaf
capsize
capstan
capsular
capsulation
capsule
capsuliferous
capsuliform
capsuligenous
capsulize
capsulotomy
