
(ago)
ab
ab/ante
abbatia
abdomen
abies
aboleo
accipiter
acer
acer/fero
acer/folium
acer/forma
acer/oleo
acer/premo
acer/pungo
acer/salix
acervus
-acia, -atia
acinus/forma
-acitas
-acius
ad
ad maiorem Dei gloriam magis/deus/gloria
ad malam crucem malus/crux
adeps
admeasure
admeasurement
admedial
administer
administrate
administration
administrative
administrator
administratrix
admirable
admirably
admiral
admiration
admire
admirer
admiringly
adulor
aedes
aeger
Aemilia
aemulus
aeqqus/libra
aequus
aequus/ango
aequus/animus
aequus/finis
aequus/latus
aequus/libra
aequus/nomen
aequus/nox
aequus/numerus
aequus/pars
aequus/pendo
aequus/pes
aequus/pluit
aequus/potis
aequus/probus
aequus/rota
aequus/sonus
aequus/sto
aequus/unus/vox
aequus/valeo
aequus/valvae
aequus/volvo
aequus/vox
aer
aer/dico
aer/fero
aer/folium
aer/forma
aer/fortis
aer/linum
aer/omnis
aer/planus
aer/portus
aer/probus
aer/rota
aestas
aestimo
aevum
Afer
agent provocateur (Fr) ago/vox
ager
ager/colo
aggiornomento (It) dies
agglomerate
agglomeration
agglutin
agglutinate
aggrade
aggrandize
aggrandizement
aggravate
aggravating
aggravatingly
aggravation
aggregate
aggregation
aggregative
aggress
aggression
aggressive
aggressively
aggressiveness
agnus/deus
ago
ago/aio
ago/ergo/sum
ago/fides
ago/mater
ago/pango
ago/purus
aio
ala
ala/fero
ala/forma
ala/pes
alacer
Albis
albus
albus/frons
albus/longus
algeo
-alis
alius
alius/quantus
alius/quot
all 5 + premo
alo
alo/caedo
alo/cumulus
alo/fero
alo/gero
alo/mater
alo/planus
alo/sterno
Alpes
alter
alter/curro
alter/ego
alter/genus
alumen
alumen/fero
alveus
amarus
ambo
ambo/ dexter
ambo/ago
ambo/as
ambo/dexter
ambo/eo
ambo/frango
ambo/latus
ambo/sinister
ambo/sonus
ambo/valeo
ambulo
ami (Fr)
amiability
amiable
amictus
amita
amnis/colo
amo
amo/curia
amo/proprius
amplus
amplus/facio/stimulus/
amplus/modus
ampulla
amuletum
anas
ancilla
angaria
ango
ango/folium
ango/pectus
anguis
anguis/forma
anguis/herba
animus
animus/mundus
animus/verto
annus
annus/domus
annus/verto
-ans, -ant
ansa
anser
ante
ante/bellum
ante/capio
ante/cedo
ante/do
ante/febris
ante/figo
ante/flecto
ante/labium
ante/lavo
ante/locus
ante/medius/dies
ante/mors
ante/nascor
ante/nubo
ante/paene/ultra
ante/pario
ante/paro
ante/post
ante/prandium
ante/rego
ante/res
ante/verto
antenna
-antia
Antonius
anus
anus (b.p.)
anus (o.w.)
anus/rego
anus/teneo
aperio
apex
apis
apis/caedo
apis/colo
apis/voro
aptus
aqua
aqua/bibo
aqua/cado
aqua/clarus
aqua/claudo
aqua/colo
aqua/duco
aqua/fero
aqua/forma
aqua/fortis
aqua/mare
aqua/planus
aqua/rego
aqua/tingo
aqua/vivo
aquila
aranea
aranea/forma
arbiter
arbiter/bibo
arbor
arbor/caedo
arbor/colo
arceo
arcus
arcus/forma
arcus/sedeo
arcus/trabs
ardeo
arduus
area
arena
arena/colo
areo
argentum
argentum/fero
argilla
arguo
aries
-aris
arithmetic progression gradior
-arium
ark
arm (body part)
arm (v)
arma
arma/gero
arma/sto
armada
armadillo
armament
armature
armiger
armigerous
armistice
armoire
armor
armor-bearer
armored
armorer
armorial
armory
armpit
arms (war)
army
aro
around
ars
ars/facio
artus
arundo
arvum
arvum/colo
as
asinus
asper
astus
ater
ater/bilis
-atus
audeo
audio
audio/clueo
audio/clueo/magis
audio/mare
audio/video
augeo
Auriga
aurora
aurora/auster
aurum
aurum/fero
aurum/flagro
aurum/medius/ocris
aurum/mola
aurum/pingo
auster
autumnus
autumnus/aequus/nox
avena
avena/forma
aveo
avis
avis/caedo
avis/colo
avis/Faunus
avis/gero
avis/specio
avus
axis
B
baby-farm
baca
baca/fero
baca/forma
baca/laurus
baca/voro
baccalaureate
baccate
bacciferous
bacciform
baccivorous
bachelor
bacilliform
back page
backcountry
backcourt
backcross
back-formation
backline
backpedal
backspace
backstage
bactericidal
bactericide
baculiform
bagasse
bagatelle
bagnio
bagpipe
baia
bail
baiulus
baking powder
balance
balancer
balbus
balbus/prehendo
balbutient
balbuties
balenology
balkline
balladmonger
ballpoint
balneal
balneation
balneological
balneologist
balneotherapy
balneum
balneus
balsamiferous
balteus
balteus/ linum
banknote
bankroll
bankrupt
bankruptcy
barb
barba
Barbados
barbarian
barbate
barbative
barbed
barbel
barbellate
barber
barbershop
barbet
barbicel
barbule
Barca
Barcelona
barefaced
barouche
bartender
base (evil)
baseline
BASIC
Basque
bas-relief
bass (low, evil)
bassus
bassus/levis
battuo
battuo/frons
battuo/linum
battuo/rego
Belgae
bellum
bellum/gero
bellum/potis
beo
bestia
bestia/niger
beta
bibo
bibo/pars
bilis
bilis/ruber
bis
bis/annus
bis/artus
bis/audio
bis/caput
bis/carbo
bis/cauda
bis/cavus
bis/centum
bis/centum/annus
bis/cilium
bis/colo
bis/color
bis/coquo
bis/coquus
bis/cornu
bis/corpus
bis/crus
bis/cuspis
bis/dens
bis/digitus
bis/facio
bis/fero
bis/filum
bis/findo
bis/flagrum
bis/flos
bis/focus
bis/folium
bis/for
bis/forma
bis/foro
bis/frons
bis/furca
bis/genus
bis/iungo
bis/labium
bis/lamina
bis/lanx
bis/latus
bis/ligo
bis/lingua
bis/linum
bis/littera
bis/locus
bis/macula
bis/manus
bis/medius
bis/mensis
bis/mille
bis/modus
bis/moles
bis/nascor
bis/nomen
bis/nux
bis/oculus
bis/ordo
bis/palma
bis/pando
bis/paries
bis/pario
bis/pars
bis/penna/forma
bis/pes
bis/pinna
bis/planus
bis/potis
bis/quattuor
bis/quinque
bis/radius
bis/ramus
bis/rego
bis/rostrum
bis/rota
bis/scutum
bis/seco
bis/sero
bis/serra
bis/sex
bis/sexus
bis/sonus
bis/sulcus
bis/tango
bis/tempus
bis/uncus
bis/valeo
bis/valvae
bis/valvae/voro
bis/varius
bis/venter
bis/verbum
bis/via
bis/vitta
bis/vox
bison
bitumen
blandus
boa
boa/stringo
bombus
bonus
bonus/aer
bonus/dico
bonus/dies
bonus/domus
bonus/facio
bonus/fides
bonus/genus
bonus/homo
bonus/littera
bonus/muttio
bonus/pars
bonus/populus
bonus/serus
bonus/venio
bonus/via
bonus/video
bonus/villa
bonus/vivo
bonus/volo
bos
bos/caput
botulus
botulus/forma
bracae
bractea
brevis
brevis/capsa
brevis/lingua
brevis/loquor
brevis/pes
brevis/pinna
brevis/rostrum
Britanni
brutus
bucca
bucca/lingua
bulga
bulla
bulla/dulcis
burra
bustum
buteo
caballus
cachino
caco/focus
cado
cado/bellum
cado/cornu
caecus
caedo
caedo/forma
caedo/misceo
caelebs
caelum
caelum/colo
caepa
caerimonia
Caesar
Calabria
calamitas
Caledonia
caleo
caligo
callidus
callum
calumnia
calvus
calx
calx (heel)
calx (lime)
calx/fero
calx/forma
calx/frango
calx/fugio
calx/gero
cambio
cambio/forma
campana
campana/forma
campus
campus/Mars
campus/sino
cancelli
cancer
cancer/forma
cancer/voro
candeo
candeo/potis
canis
canis/caedo
canis/magis
canis/minor
canis/voro
cano
cano/clarus
capanna
capanna/cavus
caper
caper/cornu
caper/forma
capillus
capillus/forma
capio
capio/carrus
capio/moneo
capio/moveo
capio/potis
capio/pretium
capio/tussis
capo
cappa
cappa (see OED)
capsa
capsa/fero
capsa/forma
capsa/liber
capsa/valeo
caput
caput/flos
caput/homo
caput/planta
carbo
carbo/do
carbo/fero
carbo/ops
carcer
cardo
carduus
careo
caries
carina
caro
caro/gero
caro/levis
caro/voro
carpentum
carpo
carpo/dies
carpus
carrus
carrus/pipo
carrus/portus
Carthago
carus
casa
caseus
castra
castra/metior
castro
castus
castus/ago
catena
catena/ago
catena/littera
catena/-stauro
Catilina
catinus
cauda
cauda/forma
caulis
caulis/colo
caulis/fero
caulis/flos
causa
causa/celeber
causa/facio
causa/iaceo
causa/rursus
cavea
caveo
caveo/canis
caveo/emo
caveo/venum/do
cavus
cavus/colo
cavus/cornu
cavus/febris
cedo
cedo/malus
cedo/probus
cedo/rota
cedo/servo
celeber
celer
celo
celo/colo
celo/forma
celo/fugio
Celtae
Celtae/Iberia
cena
censeo
censeo/sedeo
centum
centum/annus
centum/gradior
centum/pes
centum/pleo
cera
cera/fero
cerebrum
cerebrum/forma
cerebrum/spina
cerebrum/vas
Ceres
cerno
cerno/populus/puto
cerno/servus
cervix
cervix/scapula
cervix/vesica
cervus
cervus/cornu
ceteri/par
cibus
cicada
cicatrix
cicer
cieo
cieo/gradior
cilium
cilium/fero
cilium/forma
cimex
cincinnus
cingo
cinis
circum
circum/ambo/eo
circum/ambulo
circum/caedo
circum/cingo
circum/cornu
circum/dies
circum/duco
circum/eo
circum/fero
circum/flecto
circum/fluo
circum/foro
circum/fundo
circum/iaceo
circum/iacio
circum/litus
circum/loquor
circum/lux
circum/murus
circum/navis/ago
circum/-nuo
circum/nux
circum/oculus
circum/os
circum/pars
circum/renes
circum/rota
circum/scindo
circum/scribo
circum/sol
circum/spatium
circum/specio
circum/sto
circum/tendo
circum/terra
circum/unda
circum/vagus
circum/vallum
circum/vas
circum/venio
circum/volo
circum/volvo
cirrus
cirrus/cumulus
cirrus/fero
cirrus/flos
cirrus/gero
cirrus/gradior
cirrus/pes
cirrus/sterno
cis
cis/Alpes
cis/lux
cis/mare
cis/mons
cis/Padus
cis/pons
cis/trans
citrus
citrus/voro
civis
civis/radius
civis/servus
civis/sto
clam
clamo
clamo/pungo
clangor
clarus
clarus/audio
clarus/obscurus
clarus/sentio
clarus/video
classis
classis/scio
claudo
claudo/forma
claudo/gero
claudo/socius
claudus
clava
clava/cornu
clemens
cliens
clivis
cloaca
cloaca/magis
codex
codex/struo
cogo
cohors
cohors/Mars
cohors/rego
cohors/rota
coleus
collis
collum
collum/fero
collum/porto
colo
colo/campus
color
color/codex
color/rego
color/scio
colostrum
colpus
colpus/gratus
colpus/sto
colubra
colubra/fero
colubra/forma
colum
columba
comis
commandingly
commandment
commando
commandry
commeasurable
commemorate
commemoration
commemorative
commemorator
commence
commencement
commencer
commend
commendable
commendably
commendation
commendator
commendatory
commender
commensal
commensalism
compartmentalize
compass
compassable
compassion
compassionable
compassionate
compassionately
compassive
compassivity
compassless
compaternity
compatibility
compatible
compatibly
compear
compearance
compearant
compeer
compilo
comprehensivize
compresence
compresent
compresible
compress
compressed
compressedly
compresser
compressibility
compressingly
compression
compressional
compressionism
compressionist
compressive
compressively
compressor
compressorium
compressure
comprimario (It)
comprisable
comprise
compromise
compromiser
comprovincial
comps
comptoir
Comptometer
comptroller
compulsion
compulsionist
compulsitor
compulsive
compulsively
compulsiveness
compulsivity
compulsorily
compulsory
concilio
concinno
condio
condo
congruo
coniveo
conor
consentant
consentful
consentience
consentient
consentiently
consenting
consentingly
consentingness
consequence
consequent
consequential
consequentialism
consulo
contemporaneously
contemporarily
contemporary
contemporize
contempt
contemptibility
contemptible
contemptibly
contemptuous
contemptuously
contemptuousness temno
contend
contender
content
contentable
contented
contentedly
contentedness
contention
contentional
contra
contra/alo
contra/carrus
contra/clamo
contra/curro
contra/facio
contra/-fendo
contra/mando
contra/metior
contra/pars
contra/rego
contra/sto
contra/terra
contra/tueor
contra/verto
coquus
coquus/capanna
cor
cor/forma
cor/rex
corbis
corium
corium/colo
corium/fugio
corium/peto
cornu
cornu/fero
cornu/gero
cornu/ops
corpus
corpus/fero
corpus/linquo
cortina
coruscus
corvus
corvus/mare
costa
costa/femur
costa/fero
costa/forma
costa/linum
costa/mango
costa/scapula
coturnix
counterroll
counterround
countersalient
counterscale
counterscarp
countersecure
countersecurity
countersense
countershading
countershaft
countersign
countersignal
countersignature
countersink
counterslope
counterspell
counterspy
counterstain
counterstand
counterstep
counterstock
counterstrength
counterstroke
countersubject
countersuit
countersunk
countertendency
countertenor
counterterrorism
countertheory
countertide
crapula
cras
crassus
crassus/piscis
cratis
crebrum
crebrum/forma
credo
cremo
cremo/maneo
crena
creo
crepo
crepusculum
crepuscuum
cresco
cresco/forma
creta
crinis
crinis/colo
crinis/fero
crinis/gero
crinis/linum
crinis/pario
crinis/voro
crispus
crista
crotalus
crotalus/forma
cruor
crus
crusta
crux
crux/ago
crux/contra
crux/curro
crux/fero
crux/figo
crux/forma
crux/linum
crux/pollen
crux/pono
crux/pungo
crux/rego
crux/seco
crux/sterno
crux/tollo
crux/verbum
cubo
cubo/digitus
cuculus
cuculus/forma
cucumis
cucumis/forma
cucurbita
cucurbus
culcita
culcita/pungo
culex
culex/caedo
culex/forma
culex/fugio
culina
culmen
culmen/fero
culmen/forma
culmus
culmus/colo
culmus/fero
culpa
culpa/sto
culter
culter/forma
culter/rostrum
culus
-culus
culus/saccus
cum
cum/granum/sal
cum/laus
cumulus
cumulus/cirrus
cumulus/forma
cumulus/nimbus
cumulus/sterno
cumus
cunctor
cuneus
cuneus/ forma
cuneus/forma
cuniculus
cupa
cupa/fero
cupa/forma
cupio
cura
curia
curo
curro
curro/honos
curro/vivo
curtus
curvus
curvus/linum
cuspis
custos
cutis
cutis/color
cutis/gero
cutis/seco
cuunus/lingua
Dacia
Dacian
Dalmatia
damno
damnum
Danubius
Dardanus
de/ille/dies
debeo
debilis
decem
decem/annus
decem/as
decem/costa
decem/dens
decem/findo
decem/flos
decem/folium
decem/iungo
decem/locus
decem/norma
decem/pes
decem/pinna
decem/plecto
decem/pungo
decem/stria
decem/vir
decet
deleo
deliciae
delicio
dens
dens/forma
dens/frigo
dens/gero
dens/labium
dens/leo
dens/lingua
dens/loquor
dens/pario
dens/scalpo
densus
densus/traho
Derivative
derno
deterior
deus
deus/caedo
deus/forma
deus/gratus
deus/pario
deus/volo
dexter
dexter/auris
dexter/manus
dexter/pono
dexter/rota
dexter/sinister
dexter/verto
Diana
dico
dico (1)
dico (1)/pes
Dido
dies
dies/ira
dies/malus
digitus
digitus/forma
digitus/gradior
digitus/nervus
digitus/pars
digitus/pimma
dignus
dirus
disco
dives
divido
divido/et/paro
do
do/linum
do/mango
do/vos
doceo
doceo/deus
doleo
doleo/fero
doleo/fugio
domo
domus
domus/caedo
domus/colo
domus/genus
domus/vos
dormio
dormio/mus
dorsum
dorsum/abdomen
dorsum/cauda
dorsum/cervix
dorsum/collum
dorsum/cornu
dorsum/costa
dorsum/cubo
dorsum/duco
dorsum/fero
dorsum/figo
dorsum/flecto
dorsum/gero
dorsum/gradior
dorsum/inter
dorsum/latus
dorsum/lumbus
dorsum/medius
dorsum/pario
dorsum/scapula
dorsum/spina
dorsum/umbo
dorsum/venter
double meaning
double play
double standard
double star
double team
double-entendre (Fr)
double-entente (Fr) duo/teneo
doubleness
double-park
double-quick
doubler
doublespeak
doublet
doubletone
doubloon
doublure
doubly
doubt
doubtable
doubter
doubtful
doubtfully
doubtfulness
doubtingly
duco
duco/femina/facio
dulcis
dulcis/amarus
dulcis/flos
dulcis/fluo
dulcis/loquor
dumus
duo
duo/ago
duo/centum
duo/crux
duo/decem
duo/decem/annus
duo/densus
duo/do
duo/littera
duo/pes
duo/plecto
duo/plecto/dens
duo/plecto/pinna
duo/pleo
duo/pono
duo/seco
duo/tendo
duo/teneo
duo/vir
durus
durus/crusta
durus/mater
e-, exacer
Eboracum
ebrius
ecce
ecce/homo
edo
egeo
ego
electroluminescence
electroluminescent lux
electromigration
electromotion
electromotive
electromotor
elementum
emo
emo/capsa
emo/gratus
-ens, -enttabula
ensis
ensis/forma
-entia
eo
eo/campus
eo/circum
eo/cohors
eo/debeo
eo/dico
eo/elementum
eo/mitto/sum
eo/probus
eo/rumpo
eo/servo
eo/sto
eo/struo
eo/video
epulum
equus
ergo
ericius
erratic
erratically
erraticism
erratum
erring
erringly
erro
erro/homo/sum
erroneous
erroneously
error
errorless
errorlessly
erubescent
eructate
eructation
erudite
eruditely
erudition
-esco
et/alius
et/ceteri
et/tu/brutus
ex
exploro
exsul
exter
exter/polio
exter/sequor
exter/vagus
exter/vas
exuviae
faba
faba/forma
faber
faceo
facetus
facilitate
facilitation
facilitative
facilitator
facility
facing
facinorous
facio
facio/lingua
facio/mango
facio/pleo
facio/quattuor
facio/salvus
facio/scando/avis
facio/simul
facio/totus
facio/valeo
facio/verbum
faciolingual
facsimile
fact
facta non verba
fact-finding
faction
factional
factionalisitic
factionalism
factionalist
factionalization
factionalize
factionally
factionary
faenum
faex
fallo
fallo/pando
fallo/salvus
falx
falx/forma
fames
familia
familia/circum
fanum
far
farcio
fascinum
fascis
fastus
fatigatus
fatuus
fauces
Faunus
faveo
faveo/lingua
Favonius
favus
favus/forma
fax
febris
febris/colo
febris/fero
febris/fugio
februum
fecundus
feles
feles/caedo
feles/forma
felix
fello
femina
femina/caedo
femina/for
femur
-fendo
fenestra
feriae
feriae/magis
ferio
fero
fero/capsa
fero/frequens
fero/fungor
fero/humeo
fero/linum
fero/nomen
fero/rigo
fero/tabula
ferox
ferrum
ferrum/calx
ferrum/de/lancea
ferrum/fero
ferrum/ligo
ferus
ferveo
festino
festino/lenis
festuca
feteo
fetus
fetus/caedo
fetus/colo
fetus/fero
fetus/pario
fibra
fibra/fero
fibra/forma
fibra/genus
fibra/mus
fibra/vas
ficus
fides
fides/laboro
fides/mitto
fides/vestis
figo
filius
filius/alius/qui
filius/caedo
filius/pendo
filius/pius
filix
filix/folium
filix/forma
filum
filum/fero
filum/granum
filum/pluma
fimbriae
fimbriae/fero
findo
findo/costa
findo/lingua
findo/pario
findo/pes
findo/rostrum
fingo
finis
finis/ars
finis/fugio
finis/saeculum
fio
fio/lux
fio/moneo
fio/volo/tu
firmus
firmus/laboro
firmus/ligo
fiscus
fistula
fistula/forma
fixo
flaccus
flagro
flagro/fero
flagro/fragro
flagro/linquo
flagrum
flavus
flecto
flecto/plecto
fleo
fligo
flo
flo/forma
floccus
flos
flos/colo
flos/fero
flos/forma
flos/genus
flos/lego
flos/sugo
fluo
fluo/capio
fluo/carbo
fluo/colo
fluo/fero
fluo/forma
fluo/frango
fluo/mare
fluo/sonus
fluo/terra
fluo/vagus
focus
fodio
fodio/fero
fodio/forma
folium
folium/colo
folium/fero
folium/forma
folium/pario
follis
follis/probus
fons
fons/pinna
for
for/amo
for/caedo
for/dico
for/fero
for/loquor
for/terreo
foris
foris/arma
foris/claudo
foris/cohors
foris/facio
foris/opus
forma
forma/littera
forma/merx
formica
formica/voro
formido
formus/capio
formus/capio/forma
fornax
fornix
fornix/forma
foro
fortis
fortis/fero
fortis/magis
fortuna
foveo
fragro
frango
frater
frater/caedo
fraus
fremo
frenum
frequency distributution frequens/tribus
frequency modulus frequens/modus
frequens
frequens/modus
frequent
frequentative
frequenter
frequently
frere (Fr)
friable
friar
friary
fricassee
fricative
fricatrice
friction
frictional
frictionally
frictionize
frictionless
frigate
frige
frigeo
frigid
frigidarium
frigidity
frigidly
frigo
frigorific
frivolus
frons
frons (br)
frons (br)/fero
frons (br)/forma
frons (br)/gero
frons (br)/pario
frons (br)/voro
frons/cohors
frons/linum
frons/pagina
frons/specio
fructus
fructus/fero
fructus/forma
fructus/ius
fructus/voro
frustra
frustrum
frutillus
fugio
fulcio
fulgeo
fuligo
fullo
fulvus
fumus
fumus/ago
fundo
fundo/forma
fundus
fungor
fungus
fungus/caedo
fungus/colo
fungus/forma
fungus/voro
funis
funis/ambulo
funis/forma
funis/pendo
funus
fur
furca
furca/fero
furfur
furo
fuscus
fustis
fustis/ago
fusus
fusus/forma
fusus/moveo
Gaius
galbinus
galcies
galea
galea/ forma
galena
Gallia
gallus
gallus/forma
garrio
gaudeo
gaudeo/igitur
gaudeo/vivo
gelu
gelu/fero
gelu/forma
gelu/frango
geminus
Geminus
geminus/flos
gemma
gemma/fero
gemma/pario
gena
Gentianus
genu
genu/flecto
genu/forma
Genua
genus
genus/arma
genus/caedo
genus/celo
genus/colo
genus/crus
genus/duco
genus/par
genus/probus
genus/spina
geometric progression gradior
geostationary
gerbil
gerboa
gerent
gerfalcon
germ
German
germane
Germania
Germanic
Germanism
Germanize
Germanomania
Germanophile
Germanophobe
Germany
germarium
germcell
germcenter
germen
germicidal
germicide
germiculture
germiduct
germigene
germinal
gero
gero/pario
gibbus
gigeria
gingiva
glaber
glaber/rostrum
glacies
glacies/fluo
glacies/forma
glacies/lacus
gladius
glans
glans/fero
glans/forma
globus
globus/fero
globus/gero
glomus
gloria
gloria/culmen/deus
gloriette
glorifiable
glorification
glorifier
glorify
gloriole
gluten
gluten/lamina
gluttio
gracilis
graculus
gradior
gradior/industria
Graecus
gramen
gramen/fero
gramen/folium
gramen/forma
gramen/voro
grandis
grandis/amita
grandis/avus
grandis/domus
grandis/forma
grandis/ius
grandis/loquor
grandis/mamma
grandis/mater
grandis/nepos
grandis/pario
grandis/pars
grandis/pater
grandis/prehendo
grandis/rapio
grandis/senex
grandis/sonus
granum
granum/colo
granum/fero
granum/forma
granum/traho
granum/voro
gratus
gravis
gravis/gradior
gravis/oleo
gravis/pario
gravus
gremium
grex
grossus
grossus/granum
grossus/venter
grus/forma
gula
gurges
gusto
gutta
gutta/fero
gutta/forma
guttur
guttur/nasus
H
habeas corpus
habena
habenula
habeo
habeo/corpus
habeo/pendo
habile
habiliments
habilis
habilitate
habilitation
habilitative
habit
habitability
habitable
habitancy
habitant
habitat
habitate
Hadrianus
haereo
halo
hamus
hasta
hasta/folium
hasta/forma
haurio
hebeo
hedera
hedera/fero
hedera/forma
hedera/gero
Helvetia
herba
herba/caedo
herba/caro/voro
herba/colo
herba/fero
herba/voro
heres
heres/pareo
heres/tango
hernia
hernia/pungo
hic
hic/iaceo
hic/signum/vinco
hiems
hio
hircus
hircus/cervus
hirpex
hirtus
hirundo
Hispania
histrio
holus
holus/colo
homo
homo/caedo
homo/forma
homo/habeo
homo/rego
homo/sapio
homo/voro
honos
honos/causa
Horatius
hordeum
horreo
horreo/dico
horreo/pilus
horreo/sonus
hortor
hortus
hortus/colo
hospes
hostia
hostis
humeo
humeo/tempus
humus
humus/fundo
humus/sterno
hybrida
I
ia
-ia
iaceo
iacio
iacio/lingua
iacio/mater
iacio/portus
iacio/sum
-ial
Ianus
Ianus/forma
Iberia
Iberian
ibex
ibid.
ibidem
-ibility
-ible
-ibly
icteric
ictus
id
idee fixe (Fr)
idempotent
identical
identically
identifiability
idoneus
Idus
ieiunium
-iens, -ientfacio
ier/digitus
ieunium
ignis
ignis/colo
ignis/fero
ignis/potis
ignis/pungo
ignis/vomo
ilex
ilia
ilia/cauda
ilia/pubes
ilia/sacer
ille
ille/aptus
ille/aurum
ille/crux
ille/modus
ille/pax
ille/rego
ille/salvus
Illyria
imago
imbecilis
imber
imber/fero
imbuo
imitor
in
in/hic/signum
inanis
incoho
incus
indulgeo
induo
industria
inferus
inferus/latus
inferus/medius
infra
inguen
inhabeo
instar
insula
inter
interdental
interdependence
interdependent
interdependently
interdict
interdiction
interdictor
interdictory
interdiffuse
interdigitate
interdisciplinary
intereffective
interest
interestedly
interesting
interestingly
interface
interfacial
interfemoral
interfere
interference
interferingly
interpres
invito
-io
iocus
iocus/pars
-iosus
ira
is
is/dico
is/facio
is/iacio
is/latus
is/potis
is/sum
Isidorus
Italia
item
iterum
-itudo
iuba
iubeo
iubilo
Iulius
Iulius/claudus
iuncus
iuncus/forma
iungo
iungo/peritus
iungo/pono
iuniperus
Iuno
Iuppiter
ius
ius (juice)
ius/ago
ius/consulo
ius/dico
ius/omnis
ius/servus
ius/video
iuvenis
iuvo
iuvo/campus
iuvo/memor
J
jackass
jackrabbit
Jacksonville
jactance
jactation
jactitation
jaculator
jade
jaded
jadite
jail
K
kaiser
kale
Kalendae
Kalends
kalicine
kaliograph
kaliophile
kalium
kangaroo court
karstification
kennel
keno
keratoglobous
L
L (pound symbol)
la
lab
label
labellum
labia
labial
labialism
labiality
labialize
labially
labiate
labiatiflorous
labium
labium/dens
labium/flos
labium/lingua
labium/nasus
labium/velum
labor
labor/lingua
labor/memor
laboro
laboro/omnis/vinco
laboro/salvus
laboro/unus
lac
lac/fero
lac/flavus
lac/fluo
lac/fugio
lac/globus
lac/vegeo
lac/voro
lacer
lacerta
lacerta/forma
lacrima
lacus
lacus/frons
laedo
laedo/magis
laetus
laevus
laevus/duco
laevus/rota
laevus/torqueo
lallo
lambo
lamenta
lamina
lamina/dens
lamina/forma
lamina/palatum
lamina/planta
lamina/rostrum
lana
lana/fero
lana/flos
lana/gero
lana/voro
lancea
langueo
lanius
lapis
lapis/caedo
lapis/colo
Lares
largus
largus/ scando
laridum
larva
larva/caedo
larva/colo
larva/forma
larva/gero
larva/pario
larva/voro
lascivus
lassus
lateo
later
Latium
latro
latus
latus/costa
latus/dens
latus/folium
latus/fundus
latus/gradior
latus/pello
latus/pinna
latus/rego
latus/rostrum
Laurentinum
laurus
laus
laus/locus
lavo
lavo/vireo
laxus
lectus
lego
lego/ago
lego/lex
lego/quot
lemures
lemures/forma
lenis
lens
-lentia
lentus
leo
leo/pardus
lepus
lepus/forma
letum
letum/fero
levir
levis
levis/ago
levis/ala
levis/manus
lex
lex/fero
lex/lis
lex/tendo
liber
liber (n)
liber (n)/forma
libet
libo
libra
Libra
licet
licet/facio
lignum
lignum/colo
lignum/fero
lignum/forma
lignum/voro
ligo
ligo/crux
ligo/lictor
limbus
limbus/fero
limen
limes
limes/colo
limpidus
limus
lingua
lingua/dens
lingua/forma
lingua/potis
lino
linquo
linum
linum/oleo
liqueo
liquor
lira
lira/tremo
lis/ago
littera
littera/facio
littera/premo
litus
liveo
liveo/mors
locus
locus/cieo
locus/focus
locus/moveo
locus/pario
locus/teneo
locusta
Londinium
longus
longus/ aevum
longus/animus
longus/cauda
longus/lingua
longus/loquor
longus/manus
longus/pes
longus/pinna
longus/rostrum
longus/seco
loquor
lorum
lubricus
lucrum
luctor
Lucullus
ludus
Lugdunum
lugeo
lumbus
lupus
lupus/forma
luridus
luscus
Lusitania
Lutetia
lux
lux/fero
lux/forma
lux/fugio
lux/sol
luxuria
luxus
macer
macto
macula
macula/fero
maestus
magis
magis/animus
magis/bonus
magis/caerimonia
magis/cauda
magis/cum/laus
magis/domus
magis/fluo
magis/gloria/deus
magis/hospes
magis/ligo
magis/loquor
magis/minor
magis/opus
magis/rostrum
magis/sonus
magis/ventus
magis/vox
magnum
Maia
Maia/flos
Maia/pango
mala
mala/pes
malleus
malleus/forma
malum
malum/forma
malus
malus/aer
malus/aperio
malus/aptus
malus/claudo
malus/dico
malus/facio
malus/fero
malus/fides
malus/forma
malus/fungor
malus/genus
malus/habeo
malus/iungo
malus/mare
malus/minor
malus/nutrio
malus/odor
malus/pono
malus/proprius
malus/rego
malus/scando
malus/sequor
malus/sonus
malus/teneo
malus/traho
malus/tribus
malus/verto
malus/volo
malva
mamma
mamma/fero
mamma/forma
mando
mando (ch)/colum
mando (chew)
mando (chew)/forma
mando/caput
maneo
maneo/colo
maneo/premo
mango
mano
mantellum
mantissa
manus
manus/capio
manus/cura
manus/duco
manus/facio
manus/-fendo
manus/mitto
manus/moveo
manus/opus
manus/pleo
manus/scribo
manus/suesco
manus/teneo
mappa
marceo
marcus
mare
mare/colo
mare/nos
marga
margo
margo/forma
margo/rostrum
maritus
Mars
Mars/grossus
mas
masturbo
mateola/marcus
mater
mater/caedo
mater/facio
mater/familia
mater/focus
mater/latus
mater/linum
mater/locus
mater/potis
maturus
me/amo
me/carus
me/culpa
me/deus
me/domus
me/senex
medeor
medeor/ago
medeor/doceo
medeor/iuvo
medeor/lex
medeor/socius
medeor/vaco
medically
medicament
medicare
medicate
medication
medicative
medicator
medicatory
medicerebral
medicinal
medicinally
medicine
medico
medicolegal
medies/dies
mediety
medieval
medievalism
medievalist
medievalize
medifixed
mediocre
mediocrity
mediodigital
mediodorsal
Mediolanum
mediopalatal
medioventral
meditor
medius
medius/aevum
medius/alo
medius/cerebrum
medius/dies
medius/digitus
medius/dorsum
medius/figo
medius/locus
medius/lux
medius/mundus
medius/ocris
medius/palatum
medius/res
medius/spina
medius/super
medius/tellus
medius/terra
medius/tingo
medius/truncus
medius/venter
medor
meiocritization
mel
mel/fero
mel/fluo
mel/forma
mel/sonus
mel/voro
meles
melior
Melita
membrum
membrum/forma
memor
memor/moveo
-men
mendicus
mendum
mens
mens/caedo
mens/colo
mens/fero
mens/mors
mens/sanus/corpus
mens/vivo
mensa
mensa/vireo
menses
mensis
menstrual
menstruate
menstruation
mensurability
mensurable
mensural
mensuralist
mensurate
mensuration
-ment
mental
mentalism
mentalist
mentalistic
mentality
mentalization
mentalize
mentally
mentation
menticide
menticultural
menticulture
mentiferous
mentigerous
mentigo
mention
mentionable
mentioner
mentism
mentonniere
mentum
mentum/gero
menu
meo
meo/lego
meo/ligo
meo/varius
mephitis
merda
merda/voro
mereo
mergo
mergo/anser
merus
merx
merx/domus
meta
metacontrast
metafacial
metagelatin
metagranite
metalanguage
metalegal
metalinguistics
metaliterary
metalliferous
metalliform
metarule
metascience
metasediment
metavolcanic
metayage
metayer
mete (limit)
meticulosity
meticulous
meticulously
meticulousness
metier
metif
metior
metis
meto
metrification
metrify
metroliner
metrosexual
metus
Mexico City
mezzanine
mezzo
mezzograph
mezzo-soprano
mezzotint
mezzotinto
mi.
miasmifuge
mica
micaceous
micelle
mico
microalgae
migro
miles
milium
mille
mille/annus
mille/caleo
mille/flos
mille/gradior
mille/granum
mille/moles
mille/pes
mille/postis
mille/sequor
minae
minae/mons
Minerva
mingo
minium
minium/bis
minium/campus
minium/curro
minium/omnis
minium/rego
minium/sero
minor
minor/caput
minor/credo
minor/ligo
minor/magis
minor/nomen
minor/signum
minor/varius
mirus
mirus/dico
mirus/video
misceo
misceo/genus
misceo/linum
miser
miser/cor
mitis
mitis/ago
mitto
mitto/linum
mitto/radius
modus
modus/opus
modus/vivo
moenia
mola
mola/postis
mola/rota
moles
mollis
mollis/caedo
mollis/pilus
moneo
moneo/caedo
moneo/cambio
moneo/mango
monilia
monilia/forma
mons
mons/forma
mons/leo
mons/sto
mons/video
mora
morbus
mordeo
morning glory
morose
morosely
morosity
mors
mors/fero
mors/tu/salus
morsel
mortal
mortality
mortalize
mortalizer
mortally
mortar
mortarboard
mortarium
mortgage
mortgagee
mortician
mortiferous
mortification
mortify
mortmain
mortuary
morula
morus
mos
mosco
mosquito
mot (Fr)
motel
mother country
motif
motiferous
motific
motile
motility
motion
motion picture
motional
motionless
motitation
motivate
motivation
motivational
motivator
motive
motiveless
motley
moveo
moveo/ago
moveo/cado
moveo/carrus
moveo/fero
moveo/hospes
moveo/omnis
moveo/pes
moveo/pingo
moveo/rego
muceo
muceo/ago
muceo/duco
muceo/fero
muceo/forma
muceo/pario
muceo/voro
mucro
mucro/forma
mucus
mugio
mulceo
mulgeo
mulier
mullus
multa
multos/littera
multus
multus.vibro
multus/carrus
multus/cedo
multus/celo
multus/colo
multus/color
multus/costa
multus/cuspis
multus/dens
multus/digitus
multus/disco
multus/eo
multus/facio
multus/fetus
multus/filum
multus/findo
multus/fistula
multus/flagrum
multus/flos
multus/fluo
multus/focus
multus/folium
multus/fons
multus/for
multus/forma
multus/foro
multus/fungor
multus/furca
multus/genus
multus/gradior
multus/granum
multus/gravis
multus/iungo
multus/latus
multus/lego
multus/libra
multus/lingua
multus/linum
multus/locus
multus/loquor
multus/macula
multus/mamma
multus/medius
multus/metior
multus/mille
multus/modus
multus/nascor
multus/nervus
multus/nodus
multus/nomen
multus/nux
multus/oculus
multus/ovum
multus/pango
multus/pario
multus/pars
multus/parvus
multus/persona
multus/pes
multus/pinna
multus/planus
multus/plecto
multus/pono
multus/potis
multus/pungo
multus/radius
multus/rego
multus/scio
multus/seco
multus/sentio
multus/sero
multus/specio
multus/spica
multus/spina
multus/stilus
multus/sto
multus/sum
multus/tubus
multus/utor
multus/valeo
multus/vallum
multus/valvae
multus/varius
multus/verto
multus/via
multus/volvo
multus/vox
mulus
mundus
munus
munus/aestimo
munus/capio
munus/facio
munus/forma
munus/nascor
munus/nomen
munus/sentio
murena
murex
muria
murmur
murus
murus/forma
mus
mus/mons
musca
musca/caedo
musca/forma
musca/voro
muscus
muscus/colo
mustum
mutilus
muto
muto/rota
muttio
mutus
mutus/unguis
naevus
napus
napus/forma
narro
nascor
nascor/socius
nascor/spatium/minor
nasus
nasus/cornu
nasus/forma
nasus/frons
nasus/torqueo
natrium
navis
navis/ago
navis/cerno
navis/forma
navis/iuvo
necto
nego
Nemausus
nemus
nepos
Neptunus
Nero
nervus
nex
nidor
nidus
nidus/colo
nidus/fugio
niger
niger/caedo
nihil
nihil/nisi/bonus
nihil/potis
nihil/sine/-nuo
nihil/sto
nimbus
nimbus/sterno
nimis
niteo
nix
no
noceo
nodus
nodus/cornu
nodus/fero
nodus/flos
nodus/forma
nome
nomen
nomen/capio
nomen/concilio
nomen/pluma
non
non/compos
non/par
non/plus
nonna
norma
norma/linum
norma/tendo
nos
nos/domus
nosco
nosco/bonus
nosco/populus
noster
not Latin
novem
novem/plecto
noverca
novus
novus ordo s(a)eclorum novus/ordo/saeculum
novus/ homo
novus/lux
nox
nox/mitto
nox/video
nubes
nubes/fero
nubo
nudus
nudus/caulis
nugae
numerus
numerus/quattuor
numerus/unus
Numidia
nummus
nummus/forma
nunc/mitto
nuntio
-nuo
nuo/aptus
nutrio
nux
nux/acer
nux/ago
nux/fero
nux/findo
nux/focus
nux/forma
nux/frango
nux/fundo
nux/plecto
nux/potis
nux/voro
o
O
o/tempus/mos
OAS
ob(it)
obcordate
obdormition
obduce
obduct
obduction
obduracy
obdurate
obdurately
obdurateness
obduration
obedience
obedient
obediential
obedientiary
obediently
obeisance
obeisant
obese
obesity
obey
obeyer
obfuscate
obfuscatingly
obfuscation
obfuscatory
obimbricate
obit
obiter dictum
obituarist
obituary
object
objectable
objectant
objectee
objectglass
objectifiable
obliquus
obliviscor
obscenus
obscurus
obsidianus
obturo
ocrea
octo
octo/ango
octo/annus
octo/centum
octo/decem
octo/dens
octo/folium
octo/latus
octo/nux
octo/pars
octo/pes
octo/plecto
octo/pleo
octo/radius
octo/remus
octo/valeo
oculus
oculus/fero
oculus/forma
oculus/frons
oculus/gero
oculus/nasus
odi
odi/et/amo
odor
odor/fero
odor/veho
oleo
oleo/rego
olla
olla/pus
omen
omentum
omnis
omnis/bonus/volo
omnis/capio
omnis/causa
omnis/credo
omnis/facio
omnis/fero
omnis/fides
omnis/focus
omnis/for
omnis/forma
omnis/gero
omnis/latus
omnis/lego
omnis/lingua
omnis/loquor
omnis/lux
omnis/pario
omnis/patior
omnis/peto
omnis/potis
omnis/rego
omnis/scio
omnis/scribo
omnis/sentio
omnis/specio
omnis/sum
omnis/tempus
omnis/tollo
omnis/vagus
omnis/valeo
omnis/video
omnis/vinco/amor
omnis/volo
omnis/voro
onus
opacus
operio
operio/caput
operio/focus
operio/lectus
opinor
oppidum
ops
optimus
opto
opus
opus/cieo
opus/deus
opus/facio
opus/manus
-or
ora
orbis
orbis/texo
orbis/virus
orca
Orcus
ordo
ordo/forma
orior
orior/caedo
orior/facio
-orium
orno
oro
os
os (ossis)
os (ossis)/fero
os (ossis)/fibra
os (ossis)/frango
os (ossis)/voro
os/anus
os/cieo
os/facio
os/genus
os/lingua
os/nasus
os/rota
os/sonus
Oscus
Oscus/Umbri
-osus
otium
otium/dignus
ovis
ovis/bos
ovis/caedo
ovo
ovum
ovum/albus
ovum/caedo
ovum/celo
ovum/duco
ovum/facio
ovum/fero
ovum/flavus
ovum/forma
ovum/genus
ovum/gero
ovum/globus
ovum/muceo
ovum/pario
ovum/pono
ovum/rapio
ovum/saccus
ovum/testis
ovum/vivo
ovum/vivo/pario
ovum/voro
padus
Padus
paene/acer
paene/anus
paene/insula
paene/planus
paene/ulter
paene/umbra
paene/varius
pagina
pagus
palatium
palatum
palatum/dens
palea
palea/forma
palla
palla/pes
palleo
palleo/facio
palleo/flos
palleo/venter
palma
palma/colo
palma/crux
palma/fero
palma/findo
palma/forma
palma/pes
palma/voro
palpebra
palpo
palpo/cilia
palpo/cornu
palpo/fero
palpo/forma
palpo/gero
palumbes
palus
palus/colo
pando
pando/duo
pando/fallo
pando/femur
pando/flos
pando/forma
pando/opus
pando/pipo
pando/portus
pango
pango/facio
pango/forma
pango/memor
pango/volvo
panicle
paniculate
panification
panis
panis/et/circum
pannage
pannier
pannierman
panniform
pannose
pannus
pannus/forma
Panormus
panpipe
panplain
panplanation
panpot
Panroman
pansexual
pansified
pantex
panus
papaver
papilio
papula
papula/fero
papula/forma
par
par/digitus
par/focus
par/mutuus
par/pando
par/pinna
par/rego
par/sequor
par/terra
par/video
parco
pareo
paries
pario
pario/caedo
Parisii
parma
parma/caseus
paro
paro/dorsum
paro/pectus
pars
pars/capio
pars/color
pars/pono
parus
parvus
parvus/animus
parvus/dens
parvus/finis
parvus/folium
parvus/potis
parvus/rostrum
parvus/scio
parvus/virus
pasco
passer
passer/forma
Patavium
pater
pater/caedo
pater/familia
pater/focus
pater/latus
pater/linum
pater/locus
pater/nos
pater/patior
pater/planta
pater/potis
pater/sequor
pater/testa
patior
patior/flos
patior/sto
pauci
pauci/cura
pauci/dens
pauci/flos
pauci/folium
pauci/pinna
pauci/radius
pauper
pauper/linum
paveo
pavio
pavo
pax
pax/corpus
pax/fero
pax/magis
pax/mango
pax/prehendo
pax/rota
pax/scando
pax/texo
pax/video
pecco
pecten
pectus
pectus/loquor
pecu
pecu/colo
pedo
peior
pellis
pello
pello/iacio
pello/moveo
Pelorus
pelvis
pelvis/fero
pelvis/forma
pelvis/rego
pendo
pendo/lis
pendo/moneo
pendo/pinna
penecontemporaneous paene/tempus
peneplain
peneplanation
penes
penetrability
penetrable
penetrably
penetralia
penetrameter
penetrance
penetrant
penetrate
penetrating
penetration
penetrative
penis
penis/forma
penis/video
penuria
per
per/bulla
per/mens
per/sono
per/sui
per/venio
peritus
perna
perna/sum
Persa
Persa/sto
persona
persona/colo
persona/gratus
persona/traho
pertica
pes
pes/caper
pes/catena
pes/cura
pes/dico (1)
pes/fero
pes/findo
pes/forma
pes/gero
pes/grus
pes/lavo
pes/manus
pes/mons
pes/moveo
pes/niger
pes/palpo
pes/planus
pes/potis
pes/terra
pessimus
pestis
pestis/caedo
pestis/fero
pestis/rota
peto
peto/capio/prior
peto/moveo
pica
picus
picus/forma
pignus
pila
pilum
pilus
pilus/fero
pilus/form
pilus/forma
pilus/gero
pilus/mingo
pimma/fero
pingo
pinguis
pinna
pinna/culcita
pinna/fero
pinna/forma
pinna/gero
pinna/gradior
pinna/nervus
pinna/pes
pinna/pungo
pinna/vena
pinso
pinso/fero
pinso/genus
pinus
pinus/forma
pipo
pipo/linum
pirum
pirum/forma
piscis
piscis/caedo
piscis/colo
piscis/Faunus
piscis/forma
piscis/voro
pituita
pituita/glans
pius
pius/mater
pix
pix/furca
pix/pinus
placeo
placo
plaga
planee
plango
planned obsolescence planus/soleo
planned parenthood
planner
plano
planoblast
planoconcave
plano-convex
planodia
planogamete
planographic
planography
planometer
planont
planorbis
planosol
planospore
plansifer
planster
plant
planta
planta/gradior
planta/mola
planta/voro
plantable
planus
planus/caput
planus/cauda
planus/cavus
planus/dorsum
planus/forma
planus/orbis
planus/pario
planus/pinna
planus/rostrum
planus/solum
planus/tabula
planus/tego
planus/veho
platalea/forma
plaudo
Plautus
plebs
plebs/scio
plecto
plecto/forma
pleo
pleo/fero
pleo/linum
pleo/lux
pleo/potis
Plinius
ploro
pluit
pluit/forma
pluma
pluma/cornu
pluma/forma
pluma/pes
plumbum
plumbum/fero
plumbum/linum
plus
plus/celo
plus/dens
plus/facio
plus/flagrum
plus/flos
plus/folium
plus/forma
plus/lingua
plus/littera
plus/nomen
plus/nux
plus/pario
plus/pars
plus/potis
plus/seco
plus/sero
plus/signum
plus/sum
plus/unus
plus/valeo
plus/valvae
plus/voro
Pluto
pocula
poculum
poculum/forma
podex
polio
pollen
pollen/fero
pollen/gero
pollen/puto
pollen/voro
pollex
Pompeii
poms/levis
pomum
pomum/colo
pomum/fero
pomum/forma
pomum/granum
pono
pono/codex
pono/do
pono/flos
pono/folium
pono/gradior
pono/ille
pono/magis
pono/numerus
pono/opus
pono/pax
pono/pinna
pono/sto
pons
pons/asinus
pons/facio
populus
populus/fero
populus/frons
populus/liber
populus/opus
populus/spiro
populus/sum
porcus
porcus/piscis
porcus/spina
porta
porta/colum
porto
porto/feriae
porto/folium
porto/mantellum
porto/medeor
porto/utor/veho
portus
posco
post
post/axis
post/bellum
post/do
post/humus
post/ille
post/mors
post/nascor
postis
postumus
potis
potis/capio
potis/eo
potis/fallo
potis/forma
potis/linum
potis/mens
potis/opus
potis/planta
potis/pungo
potis/sedeo
potis/sum
poto
poto/pila
praeco
prandium
pratum
pratum/canis
pratum/solum
pravus
prehendo
prehendo/figo
prehendo/moneo
premo
premo/ago
premo/cambio
premo/coquus
premo/opus
premo/pungo
pretium
pretium/curro
pretium/dico (1)
pretium/figo
pretium/linum
pretium/porto
pretium/rota
prex
prior
prior/aevum
prior/capio
prior/capio/cano
prior/capio/pars
prior/capio/rego
prior/capio/sors
prior/domus
prior/facio
prior/genus
prior/gravis
prior/minor
prior/moveo
prior/numerus
prior/ordo
prior/par
prior/pario
prior/rosa
prior/ver
privus
privus/classis
privus/concilio
privus/lex
privus/prehendo
privus/signum
pro
pro/capio
pro/gradior
pro/longus
pro/porto
pro/sequor
pro/video
probrum
probus
probus/cohors
probus/spiro
probus/unus
procax
procella
promulgo
prope
propitius
proprius
proprius/capio
proprius/tango
prosper
provincia
prurio
pubes
pudet
puer
puer/animus
puer/colo
puer/pario
pugnus
pulcher
pulex
pullus
pullus/premo
pulmo
pulmo/ moveo
pulmo/fero
pulpa
pulpa/mola
pulpitum
puls
pulvinus
pulvinus/ capsa
pulvis
pumex
pungo
pungo/ango
pungo/delicio
pungo/forma
pungo/gero
pungo/linum
pungo/puto
pupa
pupa/forma
pupa/gero
pupa/voro
puppis
purus
purus/ago
pus
pus/forma
puteus
puto
putus
quaero
quaero/munus/facio
qualis
qualis/rota
qualis/signum
quamquam
quando
quantum meruit
quantum number
quantum orbit
quantum state
quantum sufficit
quantum theory
quantuplicity
quantus
quantus/cresco
quantus/dico
quantus/facio
quantus/libra
quantus/mereo
quantus/numerus
quantus/orbis
quantus/plecto
quantus/sto
quantus/valeo
quarantinable
quarantine
quareler
quarrel
quarrelsome
quarrier
quarry
quarryman
quart
quartal
quartan
quartation
quarter
quarterback
quarterbarrel
quartercentenary
quartercentury
quarterday
quarterdeck
quasi
quasi/classis
quasi/findo
quasi/norma
quasi/pars
quasi/populus
quasi/stella
quasi/traho
quatio
quattuor
quattuor/ seco
quattuor/ valeo
quattuor/ango
quattuor/annus
quattuor/caput
quattuor/centum
quattuor/cornu
quattuor/costa
quattuor/dens
quattuor/digitus
quattuor/filum
quattuor/findo
quattuor/finis
quattuor/folium
quattuor/forma
quattuor/furcus
quattuor/granum
quattuor/iungo
quattuor/latus
quattuor/lingua
quattuor/linum
quattuor/littera
quattuor/magis
quattuor/manus
quattuor/mille
quattuor/nomen
quattuor/pango
quattuor/pario
quattuor/pars
quattuor/pes
quattuor/pinna
quattuor/planus
quattuor/plecto
quattuor/radius
quattuor/remus
quattuor/seco
quattuor/sedeo
quattuor/sonus
quattuor/valeo
quattuor/valvae
quattuor/verto
quattuor/via
quattuor/vir
quatturo/iungo
quatuor
quercus
queror
qui
qui vive (Fr)
qui/bonus
qui/libet
qui/modus
qui/nunc
qui/sapio
qui/sum/facio
qui/sum/moneo
qui/vado
qui/verto
qui/video
qui/vivo
quies
quies/clamo
quies/pax
quinque
quinque/ango
quinque/annus
quinque/centum/annus
quinque/decem/annus
quinque/decem/centum
quinque/dens
quinque/digitus
quinque/findo
quinque/folium
quinque/pars
quinque/pes
quinque/plecto
quinque/remus
quinque/seco
quinque/sum
quinque/uncia
quinque/valeo
quinque/vir
quis custodiet custodes qui/custos
quit
quitclaim
quite
quitrent
quits
quittance
quitter
quittingtime
quittor
quiz
quod
quod vide
quodlibet
quoin
quomodo
quondam
quorum
quot
quot/dies
quot/reor
quota
quotable
ququaversal
rabies
racemus
racemus/forma
radius
radius/aer
radius/ago
radius/amo
radius/antenna
radius/capio
radius/carbo
radius/densus
radius/do
radius/durus
radius/forma
radius/frequens
radius/licet
radius/locus
radius/lux
radius/mitto
radius/munus
radius/mus
radius/nuntio
radius/opacus
radius/opus
radius/pagina
radius/rego
radius/rego/domus
radius/sentio
radius/signum
radius/sileo
radius/sonus
radius/specio
radius/sterilis
radius/sto
radius/tego
radius/video
radix
radix/colo
radix/flos
radix/forma
radix/voro
rado
raia
ramus
ramus/cornu
ramus/flos
ramus/forma
ramus/gero
ramus/pario
ramus/seco
rana
rana/forma
rana/voro
ranceo
rapio
rapum
rarus
rarus/avis
raucus
recens
reciprocus
reductio ad absurdum duco/surdus
reduction
reductionism
reductionist
reductive
reductor
redundancy
redundant
redundantly
reduplicate
reduplication
reduplicative
redux
reeducate
reeducation
reelect
reelection
reenact
reenactment
reenactor
reenforce
reenforcement
reenter
reentrant
reentry
rego
rego/ango
rego/caedo
rego/codex
rego/curro
rego/gradior
rego/lingua
rego/linum
rego/moveo
rego/rostrum
renes
renes/forma
renes/pungo
reor
reor/figo
reor/limes
reor/pax
reor/sum
repo
repo/fero
repo/forma
repo/voro
res
res/gero
res/nascor
res/populus
res/sto
resina
resina/fero
rete
rete/forma
retro
retro/gero
retro/video
Rhenum
rideo
rigeo
rigeo/mors
rigo
rima
rima/forma
ringor
ripa
ripa/frons
rito
-rito
ritus
rivus
rivus/grandis
rivus/Ianus
robur
rodo
rodo/caedo
rogo
Roma
Roma/collum
Roma/numerus
ros/fero
ros/mare
rosa
rosa/color
rostrum
rostrum/hamus
rota
rota/costa
rota/fero
rota/gravis
rota/tabula
rota/virus
ruber
ruber/fugio
Rubicon
ructo
ructo/rego
rudis
rufus
ruga
rugio
rumen
rumor
rumor/mango
rumpo
rumpo/caper
rumpo/colo
ruo
rus
Sabinus
sabulum
saccus
saccus/forma
sacer
sacer/do
sacer/ilia
sacer/lego
sacer/sancio
sacer/spina
saeculum
saepes
saepes/frango
sagio
sagitta
sagitta/forma
sal
sal/fero
salio
salio/gradior
saliva
salix
salmo
salvus
salvus/arma
salvus/duco
salvus/valvae
sancio
sanguis
sanus
sapio
sapio/facio
sapio/vivo
sapo
sarcio
satelles
satis
satis/patior
satis/pungo
Saturnus
saxum
saxum/cavus
saxum/colo
saxum/frango
scabo
scalpo
scalpo/forma
scamnum
scando
scando/forma
scandula
scapulae
scapulae/claudo
scindo
scintilla
scintilla/scando
scio
scio/fingo
scio/iacio
scio/licet
scopae
scopae/pes
Scotia
scribo
scrinium
scrobis
scrofa
scrotum
scrotum/forma
scrupus
scruta
scrutus
sculpo
scurra
scutra
scutum
scutum/fero
scutum/forma
scutum/gero
scutum/pes
sebum
sebum/fero
sebum/pario
seco
seco/caedo
seco/celo
seco/colo
seco/cornu
seco/fero
seco/flos
seco/forma
seco/fugio
seco/voro
second base
second best
second car
second degree
second line
secondary conditioning sequor/dico
secondary education
second-class
second-division
secondee
seconder
second-garde
second-guess
secondhand
sedeo
sedeo/lego
sedeo/vaco
sella
semi/caput
semisemiannus
senatus/populus/Roma
senex
sentio
sentio/capio
sentio/do
sentio/fero
sentio/unus
sepelio
septem
septem/ango
septem/annus
septem/centum
septem/centum/annus
septem/decem
septem/findo
septem/fluo
septem/folium
septem/plecto
septem/triones
septem/vir
sequester
sequor
sequor/capsa
sequor/carrus
sequor/classis
sequor/divido
sequor/duco
sequor/flos
sequor/genus
sequor/gradior
sequor/gravis
sequor/linum
sequor/pario
sequor/reor
sequor/rota
sera
serenus
Sericus
Sericus/colo
serius
sermo
sero
sero/fero
sero/voro
serpo
serpo/caedo
serpo/forma
serpo/voro
serra
serra/forma
serra/rostrum
serta
serum
serum/colo
serum/pus
serum/sanguis
serum/verto
serus
servo
servus
servus/moveo
sesqui/centum/annus
sesqui/latus
sesqui/pes
sesqui-/ter
seta
seta/forma
seta/gero
severus
sex
sex/(hora)
sex/annus
sex/centum
sex/findo
sex/folium
sex/mensis
sex/pars
sex/pes
sex/plecto
sex/radius
sexus
sexus/ago
sexus/cambio
sexus/celo
sexus/cerno
sexus/curro
sexus/digitus
sexus/duco
sexus/facio
sexus/-fendo
sexus/fero
sexus/iacio
sexus/limes
sexus/manus
sexus/pario
sexus/pars
sexus/pello
sexus/peritus
sexus/plecto
sexus/reor
sexus/rogo
sexus/sentio
sexus/stinguo
sexus/traho
sexus/urgeo
sexus/volvo
sibilus
sic
sic transit gloria mundi sic/eo/gloria/mundus
sic/semper
sica
siccus
Sicilia
side chain
side-arms
side-effect
sideline
sidenote
sidereal
sideromancy
siderostat
side-table
sideview
sidus
siecle (Fr)
siege
sierra
siesta
sigil
sigillary
sigillate
sigillation
sigillographer
sigillography
sigillum
sigla
sign
signage
signal
signalectic
signaler
signalist
signum
signum/lingua
signum/littera
signum/postis
sileo
silex
silex/alumen
silex/colo
silex/fero
siliqua
siliqua/fero
siliqua/forma
silva
silva/caedo
silva/colo
simia
simplex
simplex/mundus
simul
simul/figo
simul/linum
sincerus
sine/alo
sine/cera
sine/cura
sine/dies
sine/duo
sine/qui
singuli
singuli/valeo
singuli/video
sinister
sinister/dexter
sinister/oculus
sinister/verto
sino
sino/norma
sino/sto
sino/sto/digitus
sinus
sinus/audio
situla
soccus
socius
socius/ago
socius/credo
socius/cura
socius/gero
socius/lego
socius/lingua
socius/medeor
socius/res
socius/scio
socius/spatium
socius/sto
socius/studeo
socius/traho
socius/volvo
sodalis
sol
sol/carrus
sol/celo
sol/forma
sol/lux
sol/pannus
sol/plecto
sol/potis
sol/sto
sol/tabula
sol/terra
solemnis
soleo
solidus
solidus/focus
solidus/solus/pes
solidus/solvo
solidus/sto
solidus/unguis
solor
solum
solum/caedo
solum/dico
solum/haurio
solum/nutrio
solum/operio
solum/premo
solum/rodo
solum/tego
solus
solus/annus
solus/fides
solus/fluo
solus/is
solus/loquor
solus/vagus
solvo
solvo/ambulo
solvo/seco
solvo/sto
solvo/traho
somnus
somnus/ambulo
somnus/fero
somnus/loquor
somnus/volo
sonus
sonus/dico
sonus/fero
sonus/imago
sonus/insula
sonus/linum
sonus/postis
sonus/probus
sonus/tego
sopor
sopor/fero
sorbeo
sorbeo/facio
sordeo
sorex
soror
soror/caedo
sors
sors/codex
sors/lego
spargo
spatium
spatium/aevum
spatium/caput
spatium/colo
spatium/laboro
spatium/linum
spatium/portus
spatium/salvus
spatium/sto
spatium/tempus
specio
specio/capio
specio/magis
specio/mola
specio/par
specio/pauper
specio/placeo
specio/probus
specio/sanus
specio/sum
spero
spes
spica
spica/fero
spica/forma
spica/gero
spina
spina/culmen
spina/fero
spina/forma
spina/gero
spina/gradior
spina/nodus
spiro
spiro/corpus
spissus
splendeo
splendeo/fero
spolium
spolium/persona
spolium/populus
spolium/porto
spondeo
spons
spuma
spuo
spuo/fero
spurius
squaleo
squalus
squalus/forma
squama
squama/fero
squama/forma
squama/gero
squama/pinna
squarrosus
st
stagnum
stagnum/colo
stagnum/flo
stannum
stannum/fero
statim
-stauro
-stauro/capio
-stauro/frons
-stauro/locus
-stauro/sto
-stauro/tego
stella
stella/fero
stella/forma
stella/mare
stercus
stercus/bilis
stercus/colo
stercus/voro
sterilis
sterno
sterno/carrus
sterno/cerno
sterno/cirrus
sterno/credo
sterno/cumulus
sterno/forma
sterno/populus
sterno/Vulcanus
sternuo
sterto
-stigo
stilla
stilus
stilus/forma
stilus/sto
stimulus
stimulus/capio
stimulus/fundo
stimulus/spondeo
stinguo
stipo
stipo/fero
stipo/forma
stips
stirps
stirps/colo
sto
sto/caedo
sto/caput
sto/cedo
sto/cerno
sto/fero
sto/magis
sto/manus
sto/mater
sto/pars
sto/puto
sto/qui
sto/rapio
sto/video
stolidus
street
streetcar
strenuus
strepo
stria
strideo
stringo
stringo/ago
stringo/delicio
stringo/facio
stringo/frango
stringo/gradior
stringo/ius
stringo/laxus
stringo/magis
stringo/rodo
stringo/testa
struo
struo/digitus/facio
struo/sto
stsgnum
studeo
studeo/unus
studium
stultus
stultus/loquor
stupeo
suadeo
suavis
sub
sub/figo
sub/frango
sub/venio
sub/vox
suber
subtilis
succinum
succinum/fero
sudo
sudo/fero
sudo/pario
suesco
suffrago
sugo
sui
sui/caedo
sui/genus
sui/qui
sui/spons
sulcus
sulcus/forma
sulfur
Sulla
sum
sum/amo
sum/tu/terra/levis
sumo
suo
super
super/bonus
super/cohors
super/cum/laus
super/gemus
super/ius
super/lumbus
super/mons
super/plus
super/salio
super/sto
super/totus
super/video
super/vigeo
super/vivo
supo
sura
surdus
surgo
sus
sus/ovis/taurus
susurrus
T
T account
T formation
T junction
T rail
T square
tab
tabella
taberna
tabernacle
tabernacular
tabes
tabescence
tabescent
tabetic
tabid
tablature
table
tableau
tableaux
tableboard
tablecloth
tableful
tabula
tabula/forma
tabula/linum
tabula/manus
tabula/mons
tabula/rado
tabula/teneo
tabula/vinum
taceo
taedet
talea
talis
talpa
talus
talus/gradior
talus/pes
Tamesis
tandem
tandem/forma
tango
tango/bulla
tango/capio
tango/celo
tango/codex
tango/credo
tango/duco
tango/emo
tango/lego
tango/levis
tango/magis
tango/nodus
tango/pax
tango/testa
tango/vaco
tango/vado
tango/verto
tango/vinum
tantus
tantus/mons
tantus/pars
tantus/tempto
tardus
tardus/gradior
Tarpeia
Tarquinius
taurus
taurus/forma
taxus
tego
tego/ago
tego/forma
tego/spina
tego/virus
tellus
telum/fero
temere
temetum
temno
templum
tempto
tempto/fero
tempto/forma
tempus
tempus/fugio
tempus/muto
tendo
tendo/tango
tendo/via
tenebrae
teneo
teneo/codex/forma/cambio
teneo/cohors
teneo/paro
tener
tener/lumbus
tenuis
tenuis/costa
tenuis/flos
tenuis/folium
tenuis/pes
tenuis/rostrum
tepeo
ter
ter/acer
ter/aequus
ter/ango
ter/annus
ter/anus
ter/arcus
ter/axis
ter/capio
ter/caput
ter/carbo
ter/carina
ter/cauda
ter/celo
ter/centum
ter/centum/annus
ter/circum
ter/clivis
ter/color
ter/cornu
ter/crus
ter/curvus
ter/cuspis
ter/dens
ter/dies
ter/domus
ter/facio
ter/filum
ter/findo
ter/finis
ter/flagrum
ter/flos
ter/focus
ter/folium
ter/forma
ter/fungor
ter/furca
ter/geminus
ter/glans
ter/hybrida
ter/iacio
ter/iungo
ter/lamina
ter/latus
ter/libra
ter/licium
ter/lingua
ter/linum
ter/littera
ter/locus
ter/lux
ter/macula
ter/membrum
ter/mensis
ter/metior
